{
  "title": "Quarantine Guidelinespdf",
  "content": "PPllaanntt QQuuaarraannttiinnee IInnffoorrmmaattiioonn SSyysstteemm ((PPQQIISS)) User Manual for Importers and Exporters Directorate of Plant Protection, Quarantine & Storage Department of Agriculture & Cooperation Ministry of Agriculture Government of India Version 1.0 Release January, 2011 Application Software Developed by SRIT, Bangalore Project Execution by User Manual ((hhttttpp::////ppllaannttqquuaarraannttiinneeiinnddiiaa..nniicc..iinn)) Agricultural Informatics Division National Informatics Centre Department of Information Technology Ministry of Communications & Information Technology Government of India, New Delhi User Manual Plant Quarantine Information System PPllaanntt QQuuaarraannttiinnee IInnffoorrmmaattiioonn SSyysstteemm ((PPQQIISS)) ((hhttttpp::////ppllaannttqquuaarraannttiinneeiinnddiiaa..nniicc..iinn)) User Manual for Exporters and Importers Directorate of Plant Protection, Quarantine & Storage Department of Agriculture & Cooperation Ministry of Agriculture Government of India Version 1.0 Release January, 2011 Application Software Developed by SRIT, Bangalore Project Execution by Agricultural Informatics Division National Informatics Centre Department of Information Technology Ministry of Communications & Information Technology Government of India, New Delhi National Informatics Centre  User Manual Plant Quarantine Information System Table of Contents Executive Summary.................................................................................................................................................4 1. Guidelines.......................................................................................................................................................5 1.1 How to access website?.....................................................................................................5 1.2 How to Register Online?...................................................................................................5 1.3 For Importers....................................................................................................................7 1.3.1 How to login?.....................................................................................................................7 1.3.2 How to Apply Online?.......................................................................................................9 1.3.3 How to know your application status?..........................................................................13 1.3.4 Import Permit  Applications list (Adv Search for IP).................................................13 1.3.5 Import Permit  Search by Application Number (Search IP)...................................15 1.3.6 Import Release Order  Applications list (Adv. Search for IR)....................................16 1.3.7 Import Release  Search by Application Number (Search IR)..................................17 1.3.8 Import Permit  View pending list.................................................................................18 1.3.9 Import Release  View pending list...............................................................................18 1.4 For Exporters...................................................................................................................19 1.4.1 How to login?...................................................................................................................19 1.4.2 How to Apply Online?.....................................................................................................21 1.4.3 How to know your application status?..........................................................................22 1.4.4 PhytoSanitary Certificates  Applications list (Adv. Search)......................................23 1.4.5 PhytoSanitary Certificates  Search by Application Number (Search PSC)...........24 1.4.6 Import Release  View pending list...............................................................................25 1.5 How to Change your password?.....................................................................................25 1.6 How to Update your profile?..........................................................................................26 1.7 Forgot your password?...................................................................................................27 2. The Directorate of Plant Protection, Quarantine & Storage (D&PPQS)............................28 2.1 Plant Quarantine.............................................................................................................28 2.2 Contact Details.................................................................................................................29 3. Project Executing Agency  National Informatics Centre.......................................................33 3.1 Contact Details.................................................................................................................33 4. Application Software Development Agency  SRIT...................................................................34 4.1 Contact Details.................................................................................................................34 Annexure  A............................................................................................................................................................35 Glossary and Acronyms.......................................................................................................................................35 National Informatics Centre  User Manual Plant Quarantine Information System Executive Summary The objective of the Plant Quarantine Information System is to provide an efficient and effective service, which fully satisfies our customers, such as importers, exporters, individuals and the Government. Plant Quarantine Information System facilitates Importers to apply online for Import Permit, Import Release Order and Exporters to apply online for Phyto-sanitary Certificate. Exporters and Importers can view the status of their application online and access history of his application during entire life cycle of the application. This will help in brining transparency in functioning. Automation of background workflow processes will result in speedy processing of these applications saving time and workload. Availability of searchable information from related documents of Import (Plant Quarantine Order) and Exports (Export inspection and certification procedure) has made the reference to these documents easy for Importers and Exporters. National Informatics Centre  User Manual Plant Quarantine Information System 1. Guidelines 1.1 How to access website? 1. Invoke Internet Browser 2. Type http://plantquarantineindia.nic.in in address bar of the Internet Browser Address Bar Figure  1 (Home Page) 3. The Screen will be displayed as above in Figure  1. 4. User can access information on the website regarding Pre-requirements, procedures for importing and exporting plant material and plant products, etc. by clicking links displayed in left window of the home page. 1.2 How to Register Online? 1. After accessing home page as given in the steps above, click Sign up link in the login window as shown in Figure-2. 2. The screen will be displayed as given in Figure  3. National Informatics Centre  User Manual Plant Quarantine Information System Sign Up Figure -2 (Sign Up / Register) 3. The screen will be displayed as given in Figure  3. 4. Enter your name. 5. While Importer / Exporter may register with any Plant Quarantine Station, provision for entering 5 addresses of his office locations has been given. Enter addresses. 6. Select Client type (Importer or Exporter) 7. Enter your IE Code (Import Export Code given by DGFT). 8. Enter Contact No. 9. Enter Mobile No. 10. Select Plant Quarantine Station where you desired to register. 11. Enter your e-mail Id. 12. For Credentials, Enter your desired login and password. 13. Specify your secret question and answer. It will be helpful in resetting your password, in case it is forgotten by you. 14. Type the code shown in the image displayed next to this field. This is necessary for avoiding cyber attacks and making website secured. 15. Fields against which * is marked are mandatory. 16. Complete the form and click the submit button. 17. After submitting, your request will be sent to respective Plant Quarantine Station. 18. Plant Quarantine Station after validating your details will activate your account. After activation you will receive e-mail message as Your account has been activated. National Informatics Centre  User Manual Plant Quarantine Information System Figure -3 (Sign up Form) 1.3 For Importers 1.3.1 How to login? 1. Login window is provided on the top right corner of the home page as shown in Figure-4. 2. Enter your login. 3. Enter your password. 4. Click Login button to Login into the system. 5. Welcome screen will be displayed as shown in Figure  5 6. In case of Importer, the list of applications submitted by the importer will be listed on the screen. Importer can view his application, print it, know its current status, Fees details and payment status in this list. National Informatics Centre  User Manual Plant Quarantine Information System Login Window Figure  4 (Login Window) Figure -5 (Importers screen) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.2 How to Apply Online? Apply Online Figure -6 (Apply Online for Importers) 1.3.2.1 Import Permit 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure 6. 3. Importer can submit the following applications online for Import Permit by clicking the respective link  a. PQForm 1- Application for Permit to Import plants/plant products for consumption or processing b. PQForm 2 - Application for Permit to Import plants/plant materials for sowing/planting/propagation c. PQForm 6 - Application for Permit to Import soil/peat or Sphagnum moss or other growing media d. PQForm 12 - Application for Permit to import live insects/mites/nematodes/microbial cultures including algae/bio-control agents 4. Fields against which * is marked are mandatory. 5. Fill the application. 6. You can save application for later submission by clicking Save Button or click Submit button to submit it. 7. You can print the application by clicking Print button. 8. You can view the fee by clicking View fee calculations link at the bottom of the screen. National Informatics Centre  User Manual Plant Quarantine Information System Figure -7 (PQ Form 1) Application for Permit to Import Plant/Plant products for consumption or processing Figure - 8 (PQ Form 2) Application for Permit to Import plants/plant materials for sowing/planting/propagation National Informatics Centre  User Manual Plant Quarantine Information System Figure - 9 (PQ Form 6) Application for Permit to Import soil/peat or Sphagnum moss or other growing media Figure - 10 (PQ Form 12) Application for Permit to import live insects/mites/nematodes/microbial cultures including algae/bio-control agents National Informatics Centre  User Manual Plant Quarantine Information System 1.3.2.2 Import Release order 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure 6. 3. Click IRO  Application for Import Release Order 4. The form will be displayed as given in Figure  11. 5. Fields against which * is marked are mandatory. 6. Fill the application. 7. You can save application for later submission by clicking Save Button or click Submit button to submit it. 8. You can print the application by clicking Print button. Figure - 11 (Import Release Order) 1.3.2.3 Applying for Re-validation 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure 6. 3. Click Request for Revalidate. National Informatics Centre  User Manual Plant Quarantine Information System 1.3.3 How to know your application status? 1. Login into the system as explained above. 2. Expand Application Status link on as shown in Figure 12. Application Status Figure - 12 (Application Status for Importers) 3. Different options are available to search your application and know the status. These are  a. Advance Search for Import Permit b. Advance Search for Import Release c. Search for Import permit by application number d. Search Import Release by application number e. View pending IP list f. View Pending IRO List 1.3.4 Import Permit  Applications list (Adv Search for IP) After clicking the link Adv. Search for IP, screen is displayed as shown in Figure  13. This list gives overview of Import permit applications of importers pending at various levels. By expanding the list by clicking the Down Double arrow link as shown in Figure- 13 at particular level, you can access your application, click it and view the application processing life cycle by clicking view link as shown in Figure  14. National Informatics Centre  User Manual Plant Quarantine Information System For Expanding Figure - 13 (Import Permit Applications pending at various levels list) View Figure - 14 (Import Permit application details, comments at various levels and History) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.5 Import Permit  Search by Application Number (Search IP) After clicking the link Search IP the screen is displayed as in Figure  15. Enter application number and click Search button. Your application details will be displayed. You can know the action at each level by clicking tabs Application Details, Scrutiny Details, Billing Details and History. History tab will display the entire life cycle of the application for Import permit. Tabs Figure - 15 (Search Import Permit by Application Number) Figure - 16 (Search Import Permit History details) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.6 Import Release Order  Applications list (Adv. Search for IR) After clicking the link Adv. Search for IR, screen is displayed as shown in Figure  16. This list gives overview of Import Release applications of importers pending at various levels. By expanding the list by clicking the Down Double arrow link as shown in Figure- 17 at particular level, you can access your application, click it and view the application processing life cycle by clicking view link. Expanding Figure - 17 (Search Import Release Applications pending at various levels list) Figure 18 (Advance Search for Import Release  Applications details) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.7 Import Release  Search by Application Number (Search IR) After clicking the link Search IR the screen is displayed as in Figure  19. Enter application number and click Search button. Your application details will be displayed. You can know the action at each level by clicking tabs Application Details, Scrutiny Details, Billing Details, Lab details, Treatment Details and History. History tab will display the entire life cycle of the application for Import permit. Figure - 19 (Search Import Release by Application Number) Figure -20 (Search Import Release by Application Number  History Details) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.8 Import Permit  View pending list After Clicking option View Pending IP List, the screen is displayed as given in Figure  21. Figure -21 (View pending Import Permit List) 1.3.9 Import Release  View pending list After Clicking option View Pending IR List, the screen is displayed as given in Figure  21. Figure  22 (View pending Import Release List) National Informatics Centre  User Manual Plant Quarantine Information System 1.4 For Exporters 1.4.1 How to login? 1. Login window is provided on the top right corner of the home page as shown in Figure-23. 2. Enter your login. 3. Enter your password. 4. Click Login button to Login into the system. 5. Welcome screen will be displayed as shown in Figure  24 6. In case of Exporter, the list of applications submitted by the Exporter will be listed on the screen. Exporter can view his application, print it, know its current status, Fees details and payment status in this list Login Window Figure  23 (Login Window) National Informatics Centre  User Manual Plant Quarantine Information System Figure  24 (Welcome Screen for Exporters) Apply online Figure  25 (Apply Online) National Informatics Centre  User Manual Plant Quarantine Information System 1.4.2 How to Apply Online? 1.4.2.1 Phyto Sanitary Certificates and Re-export 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure - 25. 3. Exporter can submit the following applications online for Import Permit by clicking the respective link  a. Phyto-Sanitary Certificates (Figure - 26) b. Re-Export (Figure - 27) 4. Fields against which * is marked are mandatory. 5. Fill the application. 6. You can save application for later submission by clicking Save Button or click Submit button to submit it. 7. You can print the application by clicking Print button. Figure  26 (Online application for Phyto-Sanitary Certificates) National Informatics Centre  User Manual Plant Quarantine Information System Figure  27 (Online application for Re-Export) 1.4.3 How to know your application status? 1. Login into the system as explained above. 2. Expand Application Status link on as shown in Figure 28. Application Status Figure  28 (Online application Status) National Informatics Centre  User Manual Plant Quarantine Information System 1.4.4 Phyto-Sanitary Certificates  Applications list (Adv. Search) After clicking the link Adv. Search, screen is displayed as shown in Figure  28. This list gives overview of applications for Phyto-Sanitary Certificates of exporters pending at various levels. By expanding the list by clicking the Down Double arrow link as shown in Figure- 29 at particular level, you can access your application, click it and view the application processing life cycle by clicking view link and it is displayed as in Figure 30. Expanding Figure  29 (Online application Status for Phyto-Sanitary Certificates) View Figure  30 (Online application Status for Phyto-Sanitary Certificates) National Informatics Centre  User Manual Plant Quarantine Information System Tabs Figure  31 (Online application Status for Phyto-Sanitary Certificates- History) 1.4.5 Phyto-Sanitary Certificates  Search by Application Number (Search PSC) After clicking the link Search PSC the screen is displayed as in Figure  32. Enter application number and click Search button. Your application details will be displayed. You can know the action at each level by clicking tabs Application Details, Scrutiny Details, Billing Details Inspection Details, Lab details, Treatment Details and History. History tab will display the entire life cycle of the application for Phyto-Sanitary Certificate. Figure  32 (Search Phyto-Sanitary Certificates by application number) National Informatics Centre  User Manual Plant Quarantine Information System 1.4.6 Import Release  View pending list After Clicking option View Pending PSC List, the screen is displayed as given in Figure  33. Figure  33 (View Pending PSC List) 1.5 How to Change your password? 1. After accessing home page as given in the steps above, click My profile link in the login window as shown in Figure-34. My Profile Figure  34 (My Profile) National Informatics Centre  User Manual Plant Quarantine Information System 2. Click Change Password link. The screen will be displayed as given in Figure-35. 3. Change your password and click Save button. Figure  35 (Change Password) 1.6 How to Update your profile? 1. After accessing home page as given in the steps above, click My profile link in the login window as shown in Figure-34. Click Update Profile and screen will be displayed as Figure  36. Update your profile and click Update button. Figure  36 (Update Profile) National Informatics Centre  User Manual Plant Quarantine Information System 1.7 Forgot your password? 1. Click Forgot Password link on the home page as shown in Figure  37. 2. Enter your Login. 3. After entering your login you will be asked your secret question specified by you in your profile. (Figure  38). 4. Enter answer and click Mail me new password button. 5. If your answer is correct, your password will be sent to your e-mail account. Forgot Password Figure  37 (Forgot Password) Figure  38 (Forgot Password) National Informatics Centre  User Manual Plant Quarantine Information System 2. The Directorate of Plant Protection, Quarantine & Storage (D&PPQS) The Directorate of Plant Protection, Quarantine & Storage (D&PPQS) established under Department of Agriculture & Cooperation of Ministry of Agriculture, Government of India, is an apex plant protection organisation in the country having the following key functions: (cid:131) To enforce Plant Quarantine Regulations issued under The Destructive Insects & Pests Act, 1914 and amendments issued there under to prevent introduction & spread of exotic pests; (cid:131) To implement the provisions of The Insecticides Act, 1968 and rules framed there under for effective control over use of pesticides; (cid:131) To fulfill international commitment and obligations in respect of locust control and phytosanitary measures; (cid:131) To introduce and popularize innovative plant protection technologies such as integrated pest management (IPM) practices; (cid:131) To impart training in areas of plant protection technology, pesticide quality testing & pesticide residue analysis etc. ; (cid:131) To coordinate and liaise with State/Union Territory Governments in all matters relating to plant protection The Plant Protection Adviser to the Government of India heads the Directorate of Plant Protection and Quarantine Station, which is located at N. H. IV, Faridabad-121001 (Haryana). The Directorate implements five central sector schemes in the area of plant protection viz., expansion of plant quarantine facilities, integrated pest management programmes, implementation of Insecticide Act, locust control and training in plant protection. 2.1 Plant Quarantine Plant quarantine aims at preventing the introduction of exotic pests through imported seeds, plants and plant material and to contain the spread of exotic pest that are accidentally got introduced to the country by implementing the provisions of The Destructive Insects & Pests Act, 1914 and the regulations issued there under. The Joint Director (PP) heads the Plant Quarantine scheme. There are five regional plant quarantine stations at Amritsar, Kolkata, Chennai, New Delhi and Mumbai and 21 minor PQ stations functioning at various sea ports/airports and land borders. National Informatics Centre  User Manual Plant Quarantine Information System 2.2 Contact Details Name and Designation Postal Address Phone, Fax, e-mail Shri. Pankaj Kumar Ministry of Agriculture, 011-23070916 (O) Joint Secretary Krishi Bhavan, 011- 23070306 (F) (Plant Protection) NEW DELHI. E-mail: pankajkumar@nic.in Shri.S.K.G.Rahate Directorate of Plant 0129-2413985(O) Joint Secretary/Plant Protection Quarantine& 0129-2412125(F)/ Protection Adviser storage(DPPQS), E-mail: ppa@nic.in to the Govt. of India. Department of Agriculture & Cooperation, Government of India, N.H-IV,FARIDABAD 121 001 (Haryana) 409/B Wing, 011- 23385026 (O) Shastri Bhavan, New Delhi  011  23384182 (F) 110001 Shri Sarvesh Rai, Ministry of Agriculture, 011-23386741 (Telefax) Director (PP) Krishi Bhavan, NEW DELHI  110 001 E-mail: rai.sarvesh@nic.in Mrs. Vandana Jain Ministry of Agriculture, Telefax : 011- 23382937 Deputy Secretary (PP) Krishi Bhavan, E-mail: vandana.jain@nic.in NEW DELHI  110 001 Shri N.K. Sinha, Ministry of Agriculture, 011- 23382922 Under Secretary (PP-I) Krishi Bhavan, 011-23386741 (Telefax) NEW DELHI  110 001 E-mail: niraj.sinha@nic.in Dr. Ravi Prakash Plant Quarantine Division 0129-2418506 (O) Joint Director (PP) Directorate of Plant 0129-2412125 (F) Protection Quarantine & 0129-2413273 (R) Storage , Department of E-mail: jdpq@nic.in Agriculture & Cooperation, Government of India, N.H-IV,FARIDABAD- 121 001 (Haryana) Dr. J.P. Singh National Plant Quarantine 011-26899297(O) Deputy Director (E) Station (NPQS), Rangapuri, 011-26138362(O) NEW DELHI  110 037 011-26138382(F) 011-26363623(O) E-mail: npqfc@nic.in Shri. Ashok Shukla Regional Plant Quarantine 01858-233776 (O) Deputy Director (PP) Station (RPQS),Ajnala Road, 01858-233775 (O) Near Air Force Station,Raja 01858-233775 (F) Sansi Airport, E-mail: rpqfsa@nic.in AMRITSAR (Punjab) National Informatics Centre  User Manual Plant Quarantine Information System Name and Designation Postal Address Phone, Fax, e-mail Shri. Shiv Sagar Verma Regional Plant Quarantine 044-22323888(O) Deputy Director (PP) Station (RPQS), 044-22347488(O) GST Road, 044-22347522(O) (Near Trident Hotel), 044-22342949(F) Meenambakkam, E-mail: rpqfsc@nic.in CHENNAI  600 027 (Tamil Nadu) Dr. Gautam Chatterjee, Regional Plant Quarantine 033-23597679(O) Deputy Director (PP) Station (RPQS), FB- 033-23213168(O) Block,Sector III, 033-23580025(F) (Opp:Shrabani Abasan), Salt 033-25119312(O) Lake City, E-mail: rpqfsk@nic.in KOLKATA  700 097. (West Bengal) Dr.N.Sathyanarayana Regional Plant Quarantine 022-23757459(O) Deputy Director (PP) Station (RPQS), Haji Bunder 022-23748541(O) Road, Sewri (E), 022-23710419(O) MUMBAI -400 015 022-23748548(F) (Maharastra) E-mail: rpqfstm@nic.in Shri.Manojpuri Goswamy Plant Quarantine Station, 040-24008276 (O) Plant Protection Officer (E) Unit No : 19&20,II Floor, E-mail: pqfsap12@nic.in Cargo Satellite Building, Samsabad Airport, HYDERABAD  500 018 (Andhra Pradesh) Dr. A. Siddique Plant Quarantine Station, 0891-2502357 (O) Assistant Director (E) Harbour, E-mail: pqfsap11@nic.in VISAKHAPATNAM 530 035 (Andhra Pradesh) Dr. A. Siddique Plant Quarantine Station, 0884-2345865 (O) Assistant Director (E) Port Area, KAKINADA (Andhra Pradesh) Dr. Gautam Chatterjee, Plant Quarantine Station, 0361-2454676 Deputy Director (PP) Guwahati (Ashirwad) Airport Road, Lankeshwar, Jalukbari P.O., Guwahati University, GUWAHATI  781 014 (Assam) Dr. Gautam Chatterjee, Plant Quarantine Station, 0612-286563 (Tele-Fax) Deputy Director (PP) Old Telegraph Office (Patna) Building, Ashram Road, RAXUAL- 845 305 (Bihar) National Informatics Centre  User Manual Plant Quarantine Information System Name and Designation Postal Address Phone, Fax, e-mail Dr. Gautam Chatterjee, Plant Quarantine Station, Deputy Director (PP) Jogbani, Araria Distt., Bihar.C/o Shri. Ashok kumar Shah (N.S.Agent), Check-Post, JOGBANI- 854 328 (Bihar) Shri O.P. Verma, Plant Quarantine Station, 0278-2211246(O) Assistant Director (PP) Plot.No.5,Chettan Society, 0278-2511248(O) Opp.Kalubha Sahebs E-mail:pqfsgj10@nic.in Banglow, BHAVNAGAR- 364 001 (Gujarat) Shri O.P. Verma, Plant Quarantine Station, 02836-228286(O) Assistant Director (PP) NU-10, B-80,Shakti Nagar, 02836-226042(R) KANDALA (Gandhidham)- E-mail:pqfsgj12@nic.in 370 201.(Gujarat) Shri.C.P.Singh Plant Protection Officer (E) 0824-2406088(O) Plant Protection Officer(E) Plant Quarantine Station, E-mail: NMPT Colony, Near NMPT sinumv@yahoo.co.in Hospital, Panambur, MANGALORE  575 010 (Karnataka) Shri.K.W.Deshkar Plant Quarantine Station, 0484-2666145(O) Assistant Director (E) Willington Island, COCHIN- 0484-2669846(O) 682 003 (Kerala) E-mail: pqfskl12@nic.in Dr.S.K.Verma Plant Quarantine Station, 0471-2474653 (O) Plant Protection Officer(E) T.C.No.38, Subash Nagar E-mail:pqfskl13@nic.in THIRUVANATHAPURAM 695 008 (Kerala) Shri. Devandra Kumar Plant Quarantine Station, 0461-2377968(O) Plant Protection Officer (E) Door.No.101,Plot No.110, 0461-2326778(O) IInd Street,CGE Colony, E-mail:pqfstn17@nic.in TUTICORIN- 628 003 (Tamil Nadu) Shri.C.Elangovan Plant Quarantine Station, 0431-2420970(O) Assistant Director (PP) Airport, TIRUCHIRAPALLI 0431-2420190(O) 620 047 (Tamil Nadu) E-mail:pqfstn13@nic.in Dr. Gautam Chatterjee, Plant Quarantine Station, Deputy Director (PP) AGARTALA C/o State Biocontrol laboratory, State Agri.Research Complex, Datta Titta, Arundhuti Nagar,AGARTALA 799 003 National Informatics Centre  User Manual Plant Quarantine Information System Name and Designation Postal Address Phone, Fax, e-mail Dr. J.P. Singh, Plant Quarantine Station, C/o. Land Customs Deputy Director (E) C/o. Land Customs Station, Station BANBASA 05943-264018 Dist., Champawat, Uttarakhand Dr. J.P. Singh, Plant Quarantine Station, C/o .Land Customs Deputy Director (E) SONAULI Station Distt. Maharajganj 05522-238434 Uttar Pradesh Dr. J.P. Singh, Plant Quarantine Station, C/o. Land Customs Deputy Director (E) RUPAIDIHA Station Distt. Bahraich(Uttar Pradesh) 05253-240418 Dr. Brajesh Mishra Plant Quarantine Station, 03552-255894(O) Plant Protection Officer (E) Dhamala Building, E-mail:pqfswb07@nic.in Rinking Pong Road, KALIMPONG- 734 301 , Darjeeling (DT) (West Bengal) Shri S.K. Sanyal Plant Quarantine Station, 03215-255067(O) Plant Protection Officer (E) Sukanta Park , 03215-254030(O) (Near Pipe Road), E-mail:pqfswb11@nic.in Bangaon  743 235, North 24 Parganas, West Bengal Dr. Brajesh Mishra Plant Quarantine Station, 0353-2555240 (O) Plant Protection Officer (E) N.H.31-C, PANI TANKI, E-mail:pqfswb10@nic.in P.O.Dulal Jote, Distt. Darjeeling, West Bengal  734 429 Dr. P. Manikkam, Plant Quarantine Station 080-25225003 (O) Dy. Director (PP) Air Cargo Complex, MSIL, Export Cargo Terminal 2nd Floor, Bangalore, Karnataka - 560017 National Informatics Centre  User Manual Plant Quarantine Information System 3. Project Executing Agency  National Informatics Centre NIC is a premier S&T Organization under the Department of Information Technology, Ministry of Communications and IT; Government of India and has 30 years of experience in catalyzing Informatics for Development in India; and work on the hypothesis Trustworthy Networking and Information System reinforces commitment on productivity. NIC is meeting the people needs through (cid:131) NICNET gateway for Internet/Intranet Access and NICNET Centres for Resources Sharing In Central, State and District Administrations; (cid:131) State Government Informatics Development Programme; (cid:131) District Informatics Development Programme; (cid:131) Mission Mode Projects in collaboration with Central and State Government Departments; Agricultural Informatics Division of NIC headed by DDG, Shri M. Moni has been playing a vital role in diffusion of informatics in agriculture sector in collaboration with Department of Agriculture & Cooperation (DAC), Department of Animal Husbandry, Dairying and Fisheries and Department of Agricultural Research and Education under Ministry of Agriculture. AGRISNET, AGRIS, AGMARKNET, DACNET, DAIC, APHNET, ARISNET, PPIN, VISTARNET, SEEDNET, Agriculture Census, NavKrishi, RKVY, MMA etc are some of the major e- Governance programs being implemented by this Division. DAC has desired to give the responsibility of software development component of Agricultural Mission Mode Project under National e-Governance Plan to NIC. Under this project 18 services have been identified initially for provision of information through various delivery channels covering: quality inputs(pesticides, fertilizers, seeds); information on soil health, crop diseases, weather, market information, procurement points, infrastructure(marketing, storage, irrigation), good agricultural practices, training, etc.; electronic certification, scheme monitoring and advisory for implementation in seven states (Himachal Pradesh, Madhya Pradesh, Assam, Jharkhand, Maharashtra, Karnataka and Kerala. Apart from these services, more services covering - information on crop development programme & technologies, farm machineries & implements, droughts, livestock development, financial services, medicinal plants, patent, allied sectors, etc. are suggested by NIC for inclusion under NeGP-AMMP. 3.1 Contact Details PPIN Project Directorate Agricultural Informatics Division National Informatics Centre A-Block, CGO Complex, New Delhi 110 003 National Informatics Centre  User Manual Plant Quarantine Information System 4. Application Software Development Agency - SRIT SRIT is global IT Solutions Company. Telecoms IT (OSS, NMS & BSS), Digitized HealthCare, Environmental Health & Safety Sciences, e-Governance Solutions and Total Enterprise Solutions designed generally for all businesses & specifically for automotive, construction and education industries are the domains that it specialize in. SRIT offers world-class software products addressing these domains. Its Application Development Centre (ODC) develops software applications for several Fortune 1000 class companies such as The Boston Consulting Group (BCG), TUV Rheinland AG, MobiApps, American Telecare and the French Generics. Headquartered in Bangalore-India, it operates in 20 countries. SRIT is a part of the 32-year-old Sobha Enterprise which has 5000+ people, US$330million in annual revenues and US$2.2billion in market capitalization 4.1 Contact Details Global Head Quarters: SRIT House, #113/1B, ITPL main Road, Kundalahalli, Bangalore 560037, India National Informatics Centre  User Manual Plant Quarantine Information System Annexure  A Glossary and Acronyms Acronym Expanded Form DAC Department of Agriculture and Cooperation, Govt, of India. DPPQS Directorate of Plant Protection, Quarantine and Storage DIA Designated Inspecting Authority G2G Government to Government G2C Government to Customer H/W Hardware ICT Information and Communication Technology. IT Information Technology. IRO Import Release Order IP Import Permit LAN Local Area Network. MIS Management Information System. NIC National Informatics Centre. NBPGR National Bureau of Plant Genetic Resources NPQS National Plant Quarantine Station PEO Post Entry Quarantine PQIS Plant Quarantine Information System PQ Plant Quarantine PP Plant Pathology PEQ Post Entry Quarantine RPQS Regional Plant Quarantine Station SRIT Sobha Renaissance Information Technology SRS System Requirements Specification. PSC Phyto Sanitary Certificate POE Point of Entry DO Duty Officer National Informatics Centre  User Manual Plant Quarantine Information System Plant Quarantine Information System User Manual for Importers and Exporters National Informatics Centre  .ertneC scitamrofnI lanoitaN ta esuoh-ni dengiseD Directorate of Plant Protection, Quarantine & Storage Department of Agriculture & Cooperation Ministry of Agriculture Government of India NH-IV Faridabad Haryana- 121001 INDIA Email : ppa@nic.in Phone : 0129-2413985 Fax : 0129-2412125 Copyright 2011 DPPQS, DAC, MoA",
  "sections": [
    {
      "title": "Section 1",
      "content": "PPllaanntt QQuuaarraannttiinnee IInnffoorrmmaattiioonn SSyysstteemm ((PPQQIISS)) User Manual for Importers and Exporters Directorate of Plant Protection, Quarantine & Storage Department of Agriculture & Cooperation Ministry of Agriculture Government of India Version 1.0 Release January, 2011 Application Software Developed by SRIT, Bangalore Project Execution by User Manual ((hhttttpp::////ppllaannttqquuaarraannttiinneeiinnddiiaa..nniicc..iinn)) Agricultural Informatics Division National Informatics Centre Department of Information Technology Ministry of Communications & Information Technology Government of India, New Delhi User Manual Plant Quarantine Information System PPllaanntt QQuuaarraannttiinnee IInnffoorrmmaattiioonn SSyysstteemm ((PPQQIISS)) ((hhttttpp::////ppllaannttqquuaarraannttiinneeiinnddiiaa..nniicc..iinn)) User Manual for Exporters and Importers Directorate of Plant Protection, Quarantine & Storage Department of Agriculture & Cooperation Ministry of Agriculture Government of India Version 1.0 Release January, 2011 Application Software Developed by SRIT, Bangalore Project Execution by Agricultural Informatics Division National Informatics Centre Department of Information Technology Ministry of Communications & Information Technology Government of India, New Delhi National Informatics Centre  User Manual Plant Quarantine Information System Table of Contents Executive Summary.................................................................................................................................................4 1. Guidelines.......................................................................................................................................................5 1.1 How to access website?.....................................................................................................5 1.2 How to Register Online?...................................................................................................5 1.3 For Importers....................................................................................................................7 1.3.1 How to login?.....................................................................................................................7 1.3.2 How to Apply Online?.......................................................................................................9 1.3.3 How to know your application status?..........................................................................13 1.3.4 Import Permit  Applications list (Adv Search for IP).................................................13 1.3.5 Import Permit  Search by Application Number (Search IP)...................................15 1.3.6 Import Release Order  Applications list (Adv. Search for IR)....................................16 1.3.7 Import Release  Search by Application Number (Search IR)..................................17 1.3.8 Import Permit  View pending list.................................................................................18 1.3.9 Import Release  View pending list...............................................................................18 1.4 For Exporters...................................................................................................................19 1.4.1 How to login?...................................................................................................................19 1.4.2 How to Apply Online?.....................................................................................................21 1.4.3 How to know your application status?..........................................................................22 1.4.4 PhytoSanitary Certificates  Applications list (Adv. Search)......................................23 1.4.5 PhytoSanitary Certificates  Search by Application Number (Search PSC)...........24 1.4.6 Import Release  View pending list...............................................................................25 1.5 How to Change your password?.....................................................................................25 1.6 How to Update your profile?..........................................................................................26 1.7 Forgot your password?...................................................................................................27 2. The Directorate of Plant Protection, Quarantine & Storage (D&PPQS)............................28 2.1 Plant Quarantine.............................................................................................................28 2.2 Contact Details.................................................................................................................29 3. Project Executing Agency  National Informatics Centre.......................................................33 3.1 Contact Details.................................................................................................................33 4. Application Software Development Agency  SRIT...................................................................34 4.1 Contact Details.................................................................................................................34 Annexure  A............................................................................................................................................................35 Glossary and Acronyms.......................................................................................................................................35 National Informatics Centre  User Manual Plant Quarantine Information System Executive Summary The objective of the Plant Quarantine Information System is to provide an efficient and effective service, which fully satisfies our customers, such as importers, exporters, individuals and the Government. Plant Quarantine Information System facilitates Importers to apply online for Import Permit, Import Release Order and Exporters to apply online for Phyto-sanitary Certificate. Exporters and Importers can view the status of their application online and access history of his application during entire life cycle of the application. This will help in brining transparency in functioning. Automation of background workflow processes will result in speedy processing of these applications saving time and workload. Availability of searchable information from related documents of Import (Plant Quarantine Order) and Exports (Export inspection and certification procedure) has made the reference to these documents easy for Importers and Exporters. National Informatics Centre  User Manual Plant Quarantine Information System 1. Guidelines 1.1 How to access website? 1. Invoke Internet Browser 2. Type http://plantquarantineindia.nic.in in address bar of the Internet Browser Address Bar Figure  1 (Home Page) 3. The Screen will be displayed as above in Figure  1. 4. User can access information on the website regarding Pre-requirements, procedures for importing and exporting plant material and plant products, etc. by clicking links displayed in left window of the home page. 1.2 How to Register Online? 1. After accessing home page as given in the steps above, click Sign up link in the login window as shown in Figure-2. 2. The screen will be displayed as given in Figure  3. National Informatics Centre  User Manual Plant Quarantine Information System Sign Up Figure -2 (Sign Up / Register) 3. The screen will be displayed as given in Figure  3. 4. Enter your name. 5. While Importer / Exporter may register with any Plant Quarantine Station, provision for entering 5 addresses of his office locations has been given. Enter addresses. 6. Select Client type (Importer or Exporter) 7. Enter your IE Code (Import Export Code given by DGFT). 8. Enter Contact No. 9. Enter Mobile No. 10. Select Plant Quarantine Station where you desired to register. 11. Enter your e-mail Id. 12. For Credentials, Enter your desired login and password. 13. Specify your secret question and answer. It will be helpful in resetting your password, in case it is forgotten by you. 14. Type the code shown in the image displayed next to this field. This is necessary for avoiding cyber attacks and making website secured. 15. Fields against which * is marked are mandatory. 16. Complete the form and click the submit button. 17. After submitting, your request will be sent to respective Plant Quarantine Station. 18. Plant Quarantine Station after validating your details will activate your account. After activation you will receive e-mail message as Your account has been activated. National Informatics Centre  User Manual Plant Quarantine Information System Figure -3 (Sign up Form) 1.3 For Importers 1.3.1 How to login? 1. Login window is provided on the top right corner of the home page as shown in Figure-4. 2. Enter your login. 3. Enter your password. 4. Click Login button to Login into the system. 5. Welcome screen will be displayed as shown in Figure  5 6. In case of Importer, the list of applications submitted by the importer will be listed on the screen. Importer can view his application, print it, know its current status, Fees details and payment status in this list. National Informatics Centre  User Manual Plant Quarantine Information System Login Window Figure  4 (Login Window) Figure -5 (Importers screen) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.2 How to Apply Online? Apply Online Figure -6 (Apply Online for Importers) 1.3.2.1 Import Permit 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure 6. 3. Importer can submit the following applications online for Import Permit by clicking the respective link  a. PQForm 1- Application for Permit to Import plants/plant products for consumption or processing b. PQForm 2 - Application for Permit to Import plants/plant materials for sowing/planting/propagation c. PQForm 6 - Application for Permit to Import soil/peat or Sphagnum moss or other growing media d. PQForm 12 - Application for Permit to import live insects/mites/nematodes/microbial cultures including algae/bio-control agents 4. Fields against which * is marked are mandatory. 5. Fill the application. 6. You can save application for later submission by clicking Save Button or click Submit button to submit it. 7. You can print the application by clicking Print button. 8. You can view the fee by clicking View fee calculations link at the bottom of the screen. National Informatics Centre  User Manual Plant Quarantine Information System Figure -7 (PQ Form 1) Application for Permit to Import Plant/Plant products for consumption or processing Figure - 8 (PQ Form 2) Application for Permit to Import plants/plant materials for sowing/planting/propagation National Informatics Centre  User Manual Plant Quarantine Information System Figure - 9 (PQ Form 6) Application for Permit to Import soil/peat or Sphagnum moss or other growing media Figure - 10 (PQ Form 12) Application for Permit to import live insects/mites/nematodes/microbial cultures including algae/bio-control agents National Informatics Centre  User Manual Plant Quarantine Information System 1.3.2.2 Import Release order 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure 6. 3. Click IRO  Application for Import Release Order 4. The form will be displayed as given in Figure  11. 5. Fields against which * is marked are mandatory. 6. Fill the application. 7. You can save application for later submission by clicking Save Button or click Submit button to submit it. 8. You can print the application by clicking Print button. Figure - 11 (Import Release Order) 1.3.2.3 Applying for Re-validation 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure 6. 3. Click Request for Revalidate. National Informatics Centre  User Manual Plant Quarantine Information System 1.3.3 How to know your application status? 1. Login into the system as explained above. 2. Expand Application Status link on as shown in Figure 12. Application Status Figure - 12 (Application Status for Importers) 3. Different options are available to search your application and know the status. These are  a. Advance Search for Import Permit b. Advance Search for Import Release c. Search for Import permit by application number d. Search Import Release by application number e. View pending IP list f. View Pending IRO List 1.3.4 Import Permit  Applications list (Adv Search for IP) After clicking the link Adv. Search for IP, screen is displayed as shown in Figure  13. This list gives overview of Import permit applications of importers pending at various levels. By expanding the list by clicking the Down Double arrow link as shown in Figure- 13 at particular level, you can access your application, click it and view the application processing life cycle by clicking view link as shown in Figure  14. National Informatics Centre  User Manual Plant Quarantine Information System For Expanding Figure - 13 (Import Permit Applications pending at various levels list) View Figure - 14 (Import Permit application details, comments at various levels and History) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.5 Import Permit  Search by Application Number (Search IP) After clicking the link Search IP the screen is displayed as in Figure  15. Enter application number and click Search button. Your application details will be displayed. You can know the action at each level by clicking tabs Application Details, Scrutiny Details, Billing Details and History. History tab will display the entire life cycle of the application for Import permit. Tabs Figure - 15 (Search Import Permit by Application Number) Figure - 16 (Search Import Permit History details) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.6 Import Release Order  Applications list (Adv. Search for IR) After clicking the link Adv. Search for IR, screen is displayed as shown in Figure  16. This list gives overview of Import Release applications of importers pending at various levels. By expanding the list by clicking the Down Double arrow link as shown in Figure- 17 at particular level, you can access your application, click it and view the application processing life cycle by clicking view link. Expanding Figure - 17 (Search Import Release Applications pending at various levels list) Figure 18 (Advance Search for Import Release  Applications details) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.7 Import Release  Search by Application Number (Search IR) After clicking the link Search IR the screen is displayed as in Figure  19. Enter application number and click Search button. Your application details will be displayed. You can know the action at each level by clicking tabs Application Details, Scrutiny Details, Billing Details, Lab details, Treatment Details and History. History tab will display the entire life cycle of the application for Import permit. Figure - 19 (Search Import Release by Application Number) Figure -20 (Search Import Release by Application Number  History Details) National Informatics Centre  User Manual Plant Quarantine Information System 1.3.8 Import Permit  View pending list After Clicking option View Pending IP List, the screen is displayed as given in Figure  21. Figure -21 (View pending Import Permit List) 1.3.9 Import Release  View pending list After Clicking option View Pending IR List, the screen is displayed as given in Figure  21. Figure  22 (View pending Import Release List) National Informatics Centre  User Manual Plant Quarantine Information System 1.4 For Exporters 1.4.1 How to login? 1. Login window is provided on the top right corner of the home page as shown in Figure-23. 2. Enter your login. 3. Enter your password. 4. Click Login button to Login into the system. 5. Welcome screen will be displayed as shown in Figure  24 6. In case of Exporter, the list of applications submitted by the Exporter will be listed on the screen. Exporter can view his application, print it, know its current status, Fees details and payment status in this list Login Window Figure  23 (Login Window) National Informatics Centre  User Manual Plant Quarantine Information System Figure  24 (Welcome Screen for Exporters) Apply online Figure  25 (Apply Online) National Informatics Centre  User Manual Plant Quarantine Information System 1.4.2 How to Apply Online? 1.4.2.1 Phyto Sanitary Certificates and Re-export 1. Login into the system as explained above. 2. Expand Apply Online link on as shown in Figure - 25. 3. Exporter can submit the following applications online for Import Permit by clicking the respective link  a. Phyto-Sanitary Certificates (Figure - 26) b. Re-Export (Figure - 27) 4. Fields against which * is marked are mandatory. 5. Fill the application. 6. You can save application for later submission by clicking Save Button or click Submit button to submit it. 7. You can print the application by clicking Print button. Figure  26 (Online application for Phyto-Sanitary Certificates) National Informatics Centre  User Manual Plant Quarantine Information System Figure  27 (Online application for Re-Export) 1.4.3 How to know your application status? 1. Login into the system as explained above. 2. Expand Application Status link on as shown in Figure 28. Application Status Figure  28 (Online application Status) National Informatics Centre  User Manual Plant Quarantine Information System 1.4.4 Phyto-Sanitary Certificates  Applications list (Adv. Search) After clicking the link Adv. Search, screen is displayed as shown in Figure  28. This list gives overview of applications for Phyto-Sanitary Certificates of exporters pending at various levels. By expanding the list by clicking the Down Double arrow link as shown in Figure- 29 at particular level, you can access your application, click it and view the application processing life cycle by clicking view link and it is displayed as in Figure 30. Expanding Figure  29 (Online application Status for Phyto-Sanitary Certificates) View Figure  30 (Online application Status for Phyto-Sanitary Certificates) National Informatics Centre  User Manual Plant Quarantine Information System Tabs Figure  31 (Online application Status for Phyto-Sanitary Certificates- History) 1.4.5 Phyto-Sanitary Certificates  Search by Application Number (Search PSC) After clicking the link Search PSC the screen is displayed as in Figure  32. Enter application number and click Search button. Your application details will be displayed. You can know the action at each level by clicking tabs Application Details, Scrutiny Details, Billing Details Inspection Details, Lab details, Treatment Details and History. History tab will display the entire life cycle of the application for Phyto-Sanitary Certificate. Figure  32 (Search Phyto-Sanitary Certificates by application number) National Informatics Centre  User Manual Plant Quarantine Information System 1.4.6 Import Release  View pending list After Clicking option View Pending PSC List, the screen is displayed as given in Figure  33. Figure  33 (View Pending PSC List) 1.5 How to Change your password? 1. After accessing home page as given in the steps above, click My profile link in the login window as shown in Figure-34. My Profile Figure  34 (My Profile) National Informatics Centre  User Manual Plant Quarantine Information System 2. Click Change Password link. The screen will be displayed as given in Figure-35. 3. Change your password and click Save button. Figure  35 (Change Password) 1.6 How to Update your profile? 1. After accessing home page as given in the steps above, click My profile link in the login window as shown in Figure-34. Click Update Profile and screen will be displayed as Figure  36. Update your profile and click Update button. Figure  36 (Update Profile) National Informatics Centre  User Manual Plant Quarantine Information System 1.7 Forgot your password? 1. Click Forgot Password link on the home page as shown in Figure  37. 2. Enter your Login. 3. After entering your login you will be asked your secret question specified by you in your profile. (Figure  38). 4. Enter answer and click Mail me new password button. 5. If your answer is correct, your password will be sent to your e-mail account. Forgot Password Figure  37 (Forgot Password) Figure  38 (Forgot Password) National Informatics Centre  User Manual Plant Quarantine Information System 2. The Directorate of Plant Protection, Quarantine & Storage (D&PPQS) The Directorate of Plant Protection, Quarantine & Storage (D&PPQS) established under Department of Agriculture & Cooperation of Ministry of Agriculture, Government of India, is an apex plant protection organisation in the country having the following key functions: (cid:131) To enforce Plant Quarantine Regulations issued under The Destructive Insects & Pests Act, 1914 and amendments issued there under to prevent introduction & spread of exotic pests; (cid:131) To implement the provisions of The Insecticides Act, 1968 and rules framed there under for effective control over use of pesticides; (cid:131) To fulfill international commitment and obligations in respect of locust control and phytosanitary measures; (cid:131) To introduce and popularize innovative plant protection technologies such as integrated pest management (IPM) practices; (cid:131) To impart training in areas of plant protection technology, pesticide quality testing & pesticide residue analysis etc. ; (cid:131) To coordinate and liaise with State/Union Territory Governments in all matters relating to plant protection The Plant Protection Adviser to the Government of India heads the Directorate of Plant Protection and Quarantine Station, which is located at N. H. IV, Faridabad-121001 (Haryana). The Directorate implements five central sector schemes in the area of plant protection viz., expansion of plant quarantine facilities, integrated pest management programmes, implementation of Insecticide Act, locust control and training in plant protection. 2.1 Plant Quarantine Plant quarantine aims at preventing the introduction of exotic pests through imported seeds, plants and plant material and to contain the spread of exotic pest that are accidentally got introduced to the country by implementing the provisions of The Destructive Insects & Pests Act, 1914 and the regulations issued there under. The Joint Director (PP) heads the Plant Quarantine scheme. There are five regional plant quarantine stations at Amritsar, Kolkata, Chennai, New Delhi and Mumbai and 21 minor PQ stations functioning at various sea ports/airports and land borders. National Informatics Centre  User Manual Plant Quarantine Information System 2.2 Contact Details Name and Designation Postal Address Phone, Fax, e-mail Shri. Pankaj Kumar Ministry of Agriculture, 011-23070916 (O) Joint Secretary Krishi Bhavan, 011- 23070306 (F) (Plant Protection) NEW DELHI. E-mail: pankajkumar@nic.in Shri.S.K.G.Rahate Directorate of Plant 0129-2413985(O) Joint Secretary/Plant Protection Quarantine& 0129-2412125(F)/ Protection Adviser storage(DPPQS), E-mail: ppa@nic.in to the Govt. of India. Department of Agriculture & Cooperation, Government of India, N.H-IV,FARIDABAD 121 001 (Haryana) 409/B Wing, 011- 23385026 (O) Shastri Bhavan, New Delhi  011  23384182 (F) 110001 Shri Sarvesh Rai, Ministry of Agriculture, 011-23386741 (Telefax) Director (PP) Krishi Bhavan, NEW DELHI  110 001 E-mail: rai.sarvesh@nic.in Mrs. Vandana Jain Ministry of Agriculture, Telefax : 011- 23382937 Deputy Secretary (PP) Krishi Bhavan, E-mail: vandana.jain@nic.in NEW DELHI  110 001 Shri N.K. Sinha, Ministry of Agriculture, 011- 23382922 Under Secretary (PP-I) Krishi Bhavan, 011-23386741 (Telefax) NEW DELHI  110 001 E-mail: niraj.sinha@nic.in Dr. Ravi Prakash Plant Quarantine Division 0129-2418506 (O) Joint Director (PP) Directorate of Plant 0129-2412125 (F) Protection Quarantine & 0129-2413273 (R) Storage , Department of E-mail: jdpq@nic.in Agriculture & Cooperation, Government of India, N.H-IV,FARIDABAD- 121 001 (Haryana) Dr. J.P. Singh National Plant Quarantine 011-26899297(O) Deputy Director (E) Station (NPQS), Rangapuri, 011-26138362(O) NEW DELHI  110 037 011-26138382(F) 011-26363623(O) E-mail: npqfc@nic.in Shri. Ashok Shukla Regional Plant Quarantine 01858-233776 (O) Deputy Director (PP) Station (RPQS),Ajnala Road, 01858-233775 (O) Near Air Force Station,Raja 01858-233775 (F) Sansi Airport, E-mail: rpqfsa@nic.in AMRITSAR (Punjab) National Informatics Centre  User Manual Plant Quarantine Information System Name and Designation Postal Address Phone, Fax, e-mail Shri. Shiv Sagar Verma Regional Plant Quarantine 044-22323888(O) Deputy Director (PP) Station (RPQS), 044-22347488(O) GST Road, 044-22347522(O) (Near Trident Hotel), 044-22342949(F) Meenambakkam, E-mail: rpqfsc@nic.in CHENNAI  600 027 (Tamil Nadu) Dr. Gautam Chatterjee, Regional Plant Quarantine 033-23597679(O) Deputy Director (PP) Station (RPQS), FB- 033-23213168(O) Block,Sector III, 033-23580025(F) (Opp:Shrabani Abasan), Salt 033-25119312(O) Lake City, E-mail: rpqfsk@nic.in KOLKATA  700 097. (West Bengal) Dr.N.Sathyanarayana Regional Plant Quarantine 022-23757459(O) Deputy Director (PP) Station (RPQS), Haji Bunder 022-23748541(O) Road, Sewri (E), 022-23710419(O) MUMBAI -400 015 022-23748548(F) (Maharastra) E-mail: rpqfstm@nic.in Shri.Manojpuri Goswamy Plant Quarantine Station, 040-24008276 (O) Plant Protection Officer (E) Unit No : 19&20,II Floor, E-mail: pqfsap12@nic.in Cargo Satellite Building, Samsabad Airport, HYDERABAD  500 018 (Andhra Pradesh) Dr. A. Siddique Plant Quarantine Station, 0891-2502357 (O) Assistant Director (E) Harbour, E-mail: pqfsap11@nic.in VISAKHAPATNAM 530 035 (Andhra Pradesh) Dr. A. Siddique Plant Quarantine Station, 0884-2345865 (O) Assistant Director (E) Port Area, KAKINADA (Andhra Pradesh) Dr. Gautam Chatterjee, Plant Quarantine Station, 0361-2454676 Deputy Director (PP) Guwahati (Ashirwad) Airport Road, Lankeshwar, Jalukbari P.O., Guwahati University, GUWAHATI  781 014 (Assam) Dr. Gautam Chatterjee, Plant Quarantine Station, 0612-286563 (Tele-Fax) Deputy Director (PP) Old Telegraph Office (Patna) Building, Ashram Road, RAXUAL- 845 305 (Bihar) National Informatics Centre  User Manual Plant Quarantine Information System Name and Designation Postal Address Phone, Fax, e-mail Dr. Gautam Chatterjee, Plant Quarantine Station, Deputy Director (PP) Jogbani, Araria Distt., Bihar.C/o Shri. Ashok kumar Shah (N.S.Agent), Check-Post, JOGBANI- 854 328 (Bihar) Shri O.P. Verma, Plant Quarantine Station, 0278-2211246(O) Assistant Director (PP) Plot.No.5,Chettan Society, 0278-2511248(O) Opp.Kalubha Sahebs E-mail:pqfsgj10@nic.in Banglow, BHAVNAGAR- 364 001 (Gujarat) Shri O.P. Verma, Plant Quarantine Station, 02836-228286(O) Assistant Director (PP) NU-10, B-80,Shakti Nagar, 02836-226042(R) KANDALA (Gandhidham)- E-mail:pqfsgj12@nic.in 370 201.(Gujarat) Shri.C.P.Singh Plant Protection Officer (E) 0824-2406088(O) Plant Protection Officer(E) Plant Quarantine Station, E-mail: NMPT Colony, Near NMPT sinumv@yahoo.co.in Hospital, Panambur, MANGALORE  575 010 (Karnataka) Shri.K.W.Deshkar Plant Quarantine Station, 0484-2666145(O) Assistant Director (E) Willington Island, COCHIN- 0484-2669846(O) 682 003 (Kerala) E-mail: pqfskl12@nic.in Dr.S.K.Verma Plant Quarantine Station, 0471-2474653 (O) Plant Protection Officer(E) T.C.No.38, Subash Nagar E-mail:pqfskl13@nic.in THIRUVANATHAPURAM 695 008 (Kerala) Shri. Devandra Kumar Plant Quarantine Station, 0461-2377968(O) Plant Protection Officer (E) Door.No.101,Plot No.110, 0461-2326778(O) IInd Street,CGE Colony, E-mail:pqfstn17@nic.in TUTICORIN- 628 003 (Tamil Nadu) Shri.C.Elangovan Plant Quarantine Station, 0431-2420970(O) Assistant Director (PP) Airport, TIRUCHIRAPALLI 0431-2420190(O) 620 047 (Tamil Nadu) E-mail:pqfstn13@nic.in Dr. Gautam Chatterjee, Plant Quarantine Station, Deputy Director (PP) AGARTALA C/o State Biocontrol laboratory, State Agri.Research Complex, Datta Titta, Arundhuti Nagar,AGARTALA 799 003 National Informatics Centre  User Manual Plant Quarantine Information System Name and Designation Postal Address Phone, Fax, e-mail Dr. J.P. Singh, Plant Quarantine Station, C/o. Land Customs Deputy Director (E) C/o. Land Customs Station, Station BANBASA 05943-264018 Dist., Champawat, Uttarakhand Dr. J.P. Singh, Plant Quarantine Station, C/o .Land Customs Deputy Director (E) SONAULI Station Distt. Maharajganj 05522-238434 Uttar Pradesh Dr. J.P. Singh, Plant Quarantine Station, C/o. Land Customs Deputy Director (E) RUPAIDIHA Station Distt. Bahraich(Uttar Pradesh) 05253-240418 Dr. Brajesh Mishra Plant Quarantine Station, 03552-255894(O) Plant Protection Officer (E) Dhamala Building, E-mail:pqfswb07@nic.in Rinking Pong Road, KALIMPONG- 734 301 , Darjeeling (DT) (West Bengal) Shri S.K. Sanyal Plant Quarantine Station, 03215-255067(O) Plant Protection Officer (E) Sukanta Park , 03215-254030(O) (Near Pipe Road), E-mail:pqfswb11@nic.in Bangaon  743 235, North 24 Parganas, West Bengal Dr. Brajesh Mishra Plant Quarantine Station, 0353-2555240 (O) Plant Protection Officer (E) N.H.31-C, PANI TANKI, E-mail:pqfswb10@nic.in P.O.Dulal Jote, Distt. Darjeeling, West Bengal  734 429 Dr. P. Manikkam, Plant Quarantine Station 080-25225003 (O) Dy. Director (PP) Air Cargo Complex, MSIL, Export Cargo Terminal 2nd Floor, Bangalore, Karnataka - 560017 National Informatics Centre  User Manual Plant Quarantine Information System 3. Project Executing Agency  National Informatics Centre NIC is a premier S&T Organization under the Department of Information Technology, Ministry of Communications and IT; Government of India and has 30 years of experience in catalyzing Informatics for Development in India; and work on the hypothesis Trustworthy Networking and Information System reinforces commitment on productivity. NIC is meeting the people needs through (cid:131) NICNET gateway for Internet/Intranet Access and NICNET Centres for Resources Sharing In Central, State and District Administrations; (cid:131) State Government Informatics Development Programme; (cid:131) District Informatics Development Programme; (cid:131) Mission Mode Projects in collaboration with Central and State Government Departments; Agricultural Informatics Division of NIC headed by DDG, Shri M. Moni has been playing a vital role in diffusion of informatics in agriculture sector in collaboration with Department of Agriculture & Cooperation (DAC), Department of Animal Husbandry, Dairying and Fisheries and Department of Agricultural Research and Education under Ministry of Agriculture. AGRISNET, AGRIS, AGMARKNET, DACNET, DAIC, APHNET, ARISNET, PPIN, VISTARNET, SEEDNET, Agriculture Census, NavKrishi, RKVY, MMA etc are some of the major e- Governance programs being implemented by this Division. DAC has desired to give the responsibility of software development component of Agricultural Mission Mode Project under National e-Governance Plan to NIC. Under this project 18 services have been identified initially for provision of information through various delivery channels covering: quality inputs(pesticides, fertilizers, seeds); information on soil health, crop diseases, weather, market information, procurement points, infrastructure(marketing, storage, irrigation), good agricultural practices, training, etc.; electronic certification, scheme monitoring and advisory for implementation in seven states (Himachal Pradesh, Madhya Pradesh, Assam, Jharkhand, Maharashtra, Karnataka and Kerala. Apart from these services, more services covering - information on crop development programme & technologies, farm machineries & implements, droughts, livestock development, financial services, medicinal plants, patent, allied sectors, etc. are suggested by NIC for inclusion under NeGP-AMMP. 3.1 Contact Details PPIN Project Directorate Agricultural Informatics Division National Informatics Centre A-Block, CGO Complex, New Delhi 110 003 National Informatics Centre  User Manual Plant Quarantine Information System 4. Application Software Development Agency - SRIT SRIT is global IT Solutions Company. Telecoms IT (OSS, NMS & BSS), Digitized HealthCare, Environmental Health & Safety Sciences, e-Governance Solutions and Total Enterprise Solutions designed generally for all businesses & specifically for automotive, construction and education industries are the domains that it specialize in. SRIT offers world-class software products addressing these domains. Its Application Development Centre (ODC) develops software applications for several Fortune 1000 class companies such as The Boston Consulting Group (BCG), TUV Rheinland AG, MobiApps, American Telecare and the French Generics. Headquartered in Bangalore-India, it operates in 20 countries. SRIT is a part of the 32-year-old Sobha Enterprise which has 5000+ people, US$330million in annual revenues and US$2.2billion in market capitalization 4.1 Contact Details Global Head Quarters: SRIT House, #113/1B, ITPL main Road, Kundalahalli, Bangalore 560037, India National Informatics Centre  User Manual Plant Quarantine Information System Annexure  A Glossary and Acronyms Acronym Expanded Form DAC Department of Agriculture and Cooperation, Govt, of India. DPPQS Directorate of Plant Protection, Quarantine and Storage DIA Designated Inspecting Authority G2G Government to Government G2C Government to Customer H/W Hardware ICT Information and Communication Technology. IT Information Technology. IRO Import Release Order IP Import Permit LAN Local Area Network. MIS Management Information System. NIC National Informatics Centre. NBPGR National Bureau of Plant Genetic Resources NPQS National Plant Quarantine Station PEO Post Entry Quarantine PQIS Plant Quarantine Information System PQ Plant Quarantine PP Plant Pathology PEQ Post Entry Quarantine RPQS Regional Plant Quarantine Station SRIT Sobha Renaissance Information Technology SRS System Requirements Specification. PSC Phyto Sanitary Certificate POE Point of Entry DO Duty Officer National Informatics Centre  User Manual Plant Quarantine Information System Plant Quarantine Information System User Manual for Importers and Exporters National Informatics Centre  .ertneC scitamrofnI lanoitaN ta esuoh-ni dengiseD Directorate of Plant Protection, Quarantine & Storage Department of Agriculture & Cooperation Ministry of Agriculture Government of India NH-IV Faridabad Haryana- 121001 INDIA Email : ppa@nic.in Phone : 0129-2413985 Fax : 0129-2412125 Copyright 2011 DPPQS, DAC, MoA",
      "page_number": 1,
      "section_type": "content",
      "keywords": [
        "user",
        "national",
        "information",
        "program",
        "informatics",
        "clicking",
        "quarantine",
        "manual",
        "import",
        "application",
        "system",
        "amendment",
        "centre",
        "scheme",
        "login",
        "guidelines",
        "search",
        "permit",
        "payment",
        "protection",
        "plant",
        "list",
        "detail",
        "monitoring",
        "station",
        "figure",
        "implementation"
      ]
    }
  ],
  "metadata": {
    "source_file": "pdfs\\Quarantine_Guidelinespdf.pdf",
    "file_size": 9319021,
    "extraction_date": "2025-08-13T13:58:07.630241",
    "department": "Ministry of Agriculture"
  },
  "keywords": [
    "user",
    "national",
    "information",
    "program",
    "informatics",
    "clicking",
    "quarantine",
    "manual",
    "import",
    "application",
    "system",
    "amendment",
    "centre",
    "scheme",
    "login",
    "guidelines",
    "search",
    "permit",
    "payment",
    "protection",
    "plant",
    "list",
    "detail",
    "monitoring",
    "station",
    "figure",
    "implementation"
  ],
  "summary": "Guidelines.......................................................................................................................................................5 1.1 How to access website?.....................................................................................................5 1.2 How to Register Online?...................................................................................................5 1.3 For Importers....................................................................................................................7 1.3.1 How to login?.....................................................................................................................7 1.3.2 How to Apply Online?.......................................................................................................9 1.3.3 How to know your application status?..........................................................................13 1.3.4 Import Permit  Applications list (Adv Search for IP).................................................13 1.3.5 Import Permit  Search by Application Number (Search IP)...................................15 1.3.6 Import Release Order  Applications list (Adv. The Directorate implements five central sector schemes in the area of plant protection viz., expansion of plant quarantine facilities, integrated pest management programmes, implementation of Insecticide Act, locust control and training in plant protection. ; electronic certification, scheme monitoring and advisory for implementation in seven states (Himachal Pradesh, Madhya Pradesh, Assam, Jharkhand, Maharashtra, Karnataka and Kerala.",
  "source_file": "pdfs\\Quarantine_Guidelinespdf.pdf",
  "processed_date": "2025-08-13T13:58:07.681673",
  "document_hash": "b4807f3fae45669d92652af7e1f5d2bc"
}