{
  "title": "Pesticides Registration",
  "content": "Computerized Registration of Pesticides Users Guide for On Line Registration Version 1.0 For Applicants Document ID: NIC-AID-PPIN-CROP-USER-MAN-001 Release Date: 23rd September 2009 Project Implementation Central Insecticides Board Agricultural Informatics Division and Registration Committee National Informatics Centre Directorate of Plant Protection, Quarantine Department of Information Technology & Storage Ministry of Communications and Department of Agriculture & Co-operation Information Technology & IT, Government Ministry of Agriculture, Government of India of IndiaA Block CGO Complex NH IV Faridabad (Haryana) - 121001 New Delhi - 110003 Application Software Developed By Infogain India Private Limited A-16 Sector-60 Noida U.P.-201301 http://www.infogain.com Guidelines for Applicant Version 1.0 - Draft 1 Table of Contents 1. Introduction.................................................................................................................3 2. Objective.....................................................................................................................3 3. Scope...........................................................................................................................3 4. Applicant Login..........................................................................................................4 5. New User Registration................................................................................................5 6. Forgot Password..........................................................................................................9 7. Applicant Homepage:...............................................................................................11 8. Form-I Application...................................................................................................12 9. Form-C Application..................................................................................................19 10. Inclusion in Schedule Application............................................................................22 11. Endorsement Application..........................................................................................25 12. Checking Application Status.....................................................................................27 13. Deficiency Report.....................................................................................................28 14. Submit Grievance......................................................................................................30 15. Checking Grievance Status.......................................................................................32 16. Edit Profile................................................................................................................33 Guidelines for Applicant Version 1.0 - Draft 2 1. INTRODUCTION Computerized Registration of Pesticides (CROP) is a web-based application for Registration of Pesticides developed for the Central Insecticides Board and Registration Committee. The application is supposed to automate the entire registration procedure. The highlights of the application are summarized below: o Online Application for Registration of Pesticides under 9(3) & 9(3b) o On line status checking. o Frequent email notification to the applicant at certain milestone of the registration process till Deficiency Reporting & Approval. o Online application for the grievances. 2. OBJECTIVE The objective of this manual is to aid the Applicant (Manufacturers, which happen to be the intended audience of this document) in understanding the features of the CROP application. The user manual provides a step-by-step description of the various functionalities. 3. SCOPE The scope of this document is limited to describe the functionality of the application for applicants. Guidelines for Applicant Version 1.0 - Draft 3 4. APPLICANT LOGIN Any registered user can log into the CIBRC portal by providing the user credentials. The login screen of an applicant is different from that of a CIBRC member. Figure 1: CROP Applicant Login Page o The Login screen displays the following elements: (cid:1) Two text fields, namely username and password. (cid:1) Login button (cid:1) A Security Code (cid:1) A text field to enter the security code (cid:1) Links  Forgot Password New User Register Here User Account Activation Prerequisites for using the system Guidelines for Applicants How to Configure your computer for Hindi Language Download Hindi Fonts Hindi Tutor Download GIST Hindi Typing Tool How to use GIST Hindi Typing Tool Search Product Search Crop Search Insecticide in Schedule o Steps to log into the homepage: 1. Open URL http://www.pesticides-registrationindia.nic.in/ 2. Enter the User Name. 3. Enter the Password. 4. Enter the Security Code as shown in the screen. 5. Click Login to access your homepage. Guidelines for Applicant Version 1.0 - Draft 4 5. NEW USER REGISTRATION Applicants, who have not already registered to CIBRC, need to register themselves before using CIBRC services by clicking New User Register Here link on the login page. The registration form for new users is displayed. Figure 2: New User Registration Step 1 Following is the step by step procedure for applicant sign-up. Step1: New User Registration o The form contains following text fields: First Name, Middle Name, Last Name, E-mail, Password, and Confirm Password. All fields marked with an asterisk (*) are mandatory. o E-mail address is a unique field and must not have been used by any existing user. o Password should be min. 8 and max. 14 characters long and have at least 1 alphabet(A-Z or a-z), 1 numeric(0-9) and 1 special character (!,@,#,$,%,,&,+,). o On clicking Submit, user receives following e-mail containing user credentials and an activation link (click here). User will not get registered unless the account activation link is selected. Guidelines for Applicant Version 1.0 - Draft 5 Figure 3: E-mail for activating new user account Step2: New User Register (Page 2) The activation link takes user to the following page where the user is required to enter the e-mail address and password communicated to him via e-mail, and click Login. Figure 4: New User Registration Page 2 Guidelines for Applicant Version 1.0 - Draft 6 Step3: New User Register (Page 3) Next, the user has to fill a registration form where he has to enter the personal details as well as the company details. Fields marked with an asterisk (*) are mandatory. Figure 5: New User Registration Page 3 Guidelines for Applicant Version 1.0 - Draft 7 o PAN number is unique and must not have been used by any existing user. It must be of 10 characters. o If Contact number is a landline number its format should be city code-phone no.. Example: 0130-2241121 If contact number is a mobile number, its format should be (for example) 9810317319 or 09810317319. Only Indian numbers are allowed. o If the applicants company has already been registered, click Find button to search for the registered company. o An applicant cannot be linked with a company which is already linked with any other applicant. o If the applicants company has not been registered, click click here to register your company. A form is displayed where the user can enter the company details. Fields marked with an asterisk (*) are mandatory. o User must install Hindi fonts and GIST Hindi Typing Tool before filling his/her details. The download links can be found on the applicant login page. o Only Indian companies are allowed to register. So if the companys address other than that of India is provided, the user should not be able to register. o Successful submission of this registration form will activate this new user account. o The user receives following e-mail on completing registration: Figure 6: E-mail received on completing registration Guidelines for Applicant Version 1.0 - Draft 8 6. FORGOT PASSWORD An applicant cannot recover his old password in case he forgets it. However, the applicant can generate new password using the Forgot Password link. The steps to generate password are outlined as below: Step1: Click Forgot Password link on the login page. The password regeneration page is displayed. Figure 7: Password Regeneration Page Step 2: Enter either Login ID or E-mail Id. Step 3: Enter the Security Code as shown in the screen. Step 4: Click Send Password. An E-mail is sent to the applicant Step 5: Click click here link in the e-mail. The Applicant is directed to Change Password Screen. Step 6: Enter New Password and click Save. Guidelines for Applicant Version 1.0 - Draft 9 Figure 8: E-mail received for password recovery Figure 9: Change Password Screen Guidelines for Applicant Version 1.0 - Draft 10 7. APPLICANT HOMEPAGE: On providing correct user credentials, the applicant enters the respective homepage. Figure 10: Applicant Homepage The Homepage displays the following elements: o A welcome message with name of the applicant and last visit date, on the upper-left corner o Three Links at the upper-right corner namely Home, Edit Profile and Logout o Four Menus, namely Registration, Application Status, Deficiency and Grievances o Registration menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Application Status menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Deficiency Reported menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Grievances menu contains following links: Submit Grievance Grievance Status Guidelines for Applicant Version 1.0 - Draft 11 8. FORM-I APPLICATION Form-I is an application for grant of certification of registration of insecticides under following sections:  9(3) TI (Technical Import), FI (Formulation Import), TIM (Technical Indigenous Manufacture), F (Formulation Indigenous Manufacture.), B/F (Bio-Pesticides), Export.  9(3b) TI, FI, TIM, F, B/F.  9(4) TI, FI, TIM, F. The Applicant can access Form-I on his homepage by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Form-I. The link displays three options: -Search submitted Form-I -Saved Form-I -Submit a new Form-I Figure 11: Form-I options o Click Submitted Form-I to list all Form-I Applications submitted by the applicant. To open a submitted form click Download Your Form-I Application. o Click Saved Form-I to display the details of the forms that were partly filled by the user but were not submitted. To open a saved form click Click here to Proceed and the user can continue to fill the form. o Click Submit a new Form-I to open a new Form-I. Guidelines for Applicant Version 1.0 - Draft 12 Form-I Product Details Screen Figure 12: Form-I Product Details Screen o Following fields of the form are mandatory: Product Name in Schedule Section Category Common Name of Insecticide Guidelines for Applicant Version 1.0 - Draft 13 o The items under Product name in schedule are all the items included in the schedule till date. Selecting an item hereby displays its IUPAC name (field no. 6(i)). Applicant will be able to apply only those products, which have been included in schedule. o The Section field contains 3 items namely 9(3), 9(3b) and 9(4). (cid:1) For Section value as 9(4), the available Category values are  TI, FI, TIM and FIM. (cid:1) For Section value as 9(3b), the available Category values are  TI, FI, TIM, FIM and Bio-Pesticides. (cid:1) For Section value as 9(3), the available Category values available are  TI, FI, TIM, FIM, Bio-Pesticides and Export. o The Applicant Details section shows the details of the applicant filled at the time of registration. o The Address of the Premises where manufacture will be done may hold more than one address and also more than one address can be selected. o In the Insecticide details section, the applicant has to provide the Common Name of the Insecticide and the Trade Name of the Insecticide. For 9(4) application, the applicant has to select from the available list already registered Insecticides. o The Product Code drop-down will be enabled only for FI and FIM category. o There can be more than one Previous Computer Serial numbers. In that case the applicant has to separate each number by comma. Previous Computer Serial Numbers are requested to check why the application was rejected previously. o In the Chemical Composition section, for 9(3), 9 (3b) categories the applicant has to provide details for the components from which the Insecticide will be made. (cid:1) More than one chemical can be added by clicking Add Chemical. (cid:1) For 9(4) category, the Chemical Composition details will be displayed depending on the value selected from the Common Name of the Insecticide dropdown. (cid:1) The IUPAC name of the Product is displayed automatically. (cid:1) The Molecular Formula involves subscripts and superscripts. To enter a subscript, the user has to use tags sub and /sub. To enter a superscript, the user has to use tags sup and /sup. For example, to enter the molecular formula CH SO2, the user must type CHsub4/subSOsup2/sup. 4 o The application will check for the number of Form-1 applications the applicant (from a company) has submitted under 9(4) TI /FI /F category for the past 3 months i.e. if the number of Submitted applications for the past 3 months is more than 3 then the applicant will not be allowed to move further (while submitting a New Form-1) for filling Form-1 details. However, the details entered will be saved and the remaining details can be filled later. o Product Conditions  Following are Product Status values for different products: 1. Pesticides Banned for manufacture, import and use 2. Pesticide formulations banned for use but their manufacture is allowed for export 3. Pesticide formulations banned for import, manufacture and use 4. Pesticide Withdrawn 5. Pesticides Refused Registration 6. Pesticides Restricted For Use In India 7. Existing Guidelines for Applicant Version 1.0 - Draft 14 The different product conditions are:  If the Product Status is 1, 4, 5, 6 then the applicant cannot apply  For Product Status 2, the applicant cannot apply under FI / FIM category  For Product Status 3, the applicant cannot apply under FI category o On clicking Save & Continue button, the applicant is taken to Form-1 attachment screen to upload the documents relating to different folders. Form-1 Attachment screen Figure 13: Form-I Attachment Screen o For 9(4) TI/FI/F applications, the folder type will be Others and the applicant has to provide the Other Folder Name. For 9(4) TIM applications, all the folder types will be available in Folder Name drop- down list. For 9(3)/9(3b) FI/F applications, the applicant has to upload MRL document and bioefficacy summary under the bioefficacy folder. Guidelines for Applicant Version 1.0 - Draft 15 For MRL document, the Folder name to be selected will be Bioefficacy, and Document Name should be specified as MRL Proforma For Bioefficacy summary the Folder name to be selected will be Bioefficacy, and Document Name should be specified as Bioefficacy Summary o The size of the document to be uploaded should not exceed 5 MB. If size is more than 5 MB, the document must be split. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o The applicant can any time go back to the previous page by clicking Back to Page 1 o The file that an applicant can attach with a folder must not exceed 5 MB. If the file is greater than 5 MB then the applicant should split the file accordingly. An applicant can attach multiple files for a folder. The supported file types are: PDF, DOC, XLS, GIF, JPEG, JPG, TIF, TXT and DOCX. o Click Save & Continue button to move to the next screen of the Form1. Form I (Page 3): Figure 14: Form-I Registration Page 3 Guidelines for Applicant Version 1.0 - Draft 16 Form-1 Payment screen Figure 15: Form-I Payment Screen o There are two modes of payment- Online and Demand Draft. Only Demand Draft option is available at present. o In case of DD payment following fields are mandatory: Bearing No. (in case of DD payment) Issuing Bank and Branch (in case of DD payment) o After Mode of Payment details have been provided, the applicant will click Submit Form-1 Application button. The applicant will be prompted with a confirmation message box like Are you sure you want to Submit the Form-1 application with two options  OK and Cancel. On clicking OK, the Form-1 will move to reception and its status will be changed to Applied for Registration and a copy of Form-1 will be sent on the e-mail of the applicant. o If the user doesnt submit the form or closes the screen before submitting, the form is automatically saved and user can rework on it by opening saved Form-I by going to Registration(cid:2)Form-1(cid:2)Search Saved Form-1. o An applicant can preview the Form-I by using the Preview Form-1 Application link. o On successful submission of Form-I, the applicant receives an acknowledgement e- mail containing the Computer Sr. No. of the application: Guidelines for Applicant Version 1.0 - Draft 17 Figure 16: E-mail received on submitting Form-I o The applicant can any time go back to any of the previous pages by clicking Back to Page 3, Back to Page 2, or Back to Page 1. o While the application is in progress same Applicant Company should not be able to apply for the same product under same category of registration. Once the application gets rejected then same applicant company can reapply for the same product with submission of required data. o Applicant will be able to apply for the registration certificate for only those products, which have been included in the schedule. o Along with the online submission of Form-I, applicant needs to submit the hard copy of the documents and product sample at CIBRC Reception. It is only when both hard and soft copies of the application have been received at the reception that the application is passed onto Preliminary Scrutiny. o The applicant is required to re-pay the registration fee in case of re-apply. o In case of reapply, the applicant must provide the Computer serial number of the previous/rejected application. If application is rejected multiple times then the applicant has to provide all the previous computer serial numbers while reapplying. Guidelines for Applicant Version 1.0 - Draft 18 9. FORM-C APPLICATION An applicant can apply for Research, Test and Trial (RTT) by submitting Form-C. To do this the applicant has to login to CIBRC web portal and submit Form C with required details. Following are the steps for submitting Form-C: Step 1: Open URL http://pesticides-registrationindia.nic.in/ Step 2: Login using valid credentials. Applicant homepage is displayed. Step 3: On the applicant homepage, navigate to Registration(cid:2)(cid:2)(cid:2)(cid:2) Form C. Three links are displayed- Submitted Form-C, Saved Form-C and Submit a New Form-C Figure 17: Form-C Options o Submitted Form-C link will display the list of Form Cs submitted by the applicant. The details of the form shown are- Name of the Manufacturer, Name of Supplier, Chemical Name, Active Product Group, Submission status, Submitted On. Clicking on Download Your Form-C Application link will generate the details of the application submitted. Figure 18: Submitted Form-C o Saved Form-C link will display the list of forms which were the applicant didnt submit but saved in the middle of filling up the form. The details of the form shown are- Name of the Manufacturer, Name of Supplier, Chemical Name, Active Product Group, Submission status, Submitted On. Clicking on Click here to Proceed link will display the saved form which the applicant can continue filling. Guidelines for Applicant Version 1.0 - Draft 19 Figure 19: Saved Form-C o Submit a New Form-C link will open a new Form-C. Step 4: Click Submit a New Form-C. Form-C is displayed. Figure 20: Form C Application Form Page 1 Guidelines for Applicant Version 1.0 - Draft 20 o The mandatory fields to be filled by the applicant are: (cid:3) Name of overseas manufacturer (cid:3) Name of Supplier (cid:3) Code Number (cid:3) Chemical Name (cid:3) Whether manufacture, sale, distribution or use is prohibited in the country of its manufacture or any restrictions have been imported thereon. If so, please give full details (cid:3) Main active group to which the chemical belongs (cid:3) Whether being imported as free sample and if so its nominal value (cid:3) Whether any examination, analysis, tests or trials are already being carried on in the country and if so, please give details o The applicant can enter more than one Previous Computer Serial Numbers each separated by a comma. o Preview Form-C Application link can be used to see the details entered by the applicant in the Form-C Step 5: Click Save & Continue. This will save the form and will take user to the Page 2 (Attachment Screen) of Form-C. Figure 21: Form C Application Page 2 Step 6: Upload Documents. o Only Bioefficacy and Toxicity documents are required to be uploaded. o The Applicant can upload any number of documents, each document of size 5 MB to the max. If document size is more than 5 MB then split the document. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o The applicant can anytime go back to previous screen for editing details of the form by clicking Back to Page 1 link. o The applicant can preview the Inclusion in Schedule Form filled by him/her by clicking Preview Form-C Application. Step 7: Click Submit Form-C Application. The submitted Form-C is saved and details for the same can be viewed by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Form-C(cid:2)(cid:2)(cid:2)(cid:2)Submitted Form-C and clicking Download your Form-C Application. Guidelines for Applicant Version 1.0 - Draft 21 10. INCLUSION IN SCHEDULE APPLICATION An applicant can apply for Inclusion in Schedule by submitting Inclusion in Schedule form available at CIBRC website. To do this the applicant has to login to CIBRC web portal and submit Inclusion in Schedule form with required details. Following are the steps for submitting Inclusion in Schedule form: Step 1: Open URL http://pesticides-registrationindia.nic.in/ Step 2: Login using valid credentials. Applicant homepage is displayed. Step 3: On the applicant homepage, navigate to Registration(cid:2)(cid:2)(cid:2)(cid:2) Inclusion in Schedule. Three links are displayed- Submitted Inclusion in Schedule, Saved Inclusion in Schedule and Submit a New Inclusion in Schedule. Figure 22: Inclusion in Schedule Options o Submitted Inclusion in Schedule link displays the list of Inclusion in Schedule Forms submitted by the applicant. The details of the form shown are- Name of the Applicant, Common Name, IUPAC/Botanical Name, Submission status, Submitted On. Clicking on Download Your Inclusion in Schedule Application link will generate the preview of the Form submitted. Figure 23: Submitted Inclusion in Schedule Applications o Saved Inclusion in Schedule displays the list of forms which were the applicant didnt submit but saved in the middle of filling up the form. The details of the form shown are- Name of the Applicant, Common Name, IUPAC/Botanical Name, Submission status, Saved On. Clicking on Click here to Proceed link will display the saved form which the applicant can continue filling. Guidelines for Applicant Version 1.0 - Draft 22 Figure 24: Saved Inclusion in Schedule Applications o Submit New Inclusion in Schedule opens a new Inclusion in Schedule Form. Step 4: Click Submit a New Inclusion in Schedule. Inclusion in Schedule application form is displayed. Figure 25: Inclusion in Schedule Application Form Page 1 o Fields marked with asterisk (*) are mandatory to be filled: (cid:3) Common Name (cid:3) IUPAC/Botanical Name (cid:3) CAS No. o The applicant can enter more than one Previous Computer Serial Numbers each separated by a comma. Step 5: Click Save & Continue. This will save the form and will take user to the Page 2 (Attachment Screen) for Inclusion in Schedule. Guidelines for Applicant Version 1.0 - Draft 23 Figure 26: Inclusion in Schedule Application Form Page 2 Step 6: Upload Documents. o Only Chemistry, Bioefficacy and Toxicity documents are required to be uploaded. o The Applicant can upload any number of documents, each document of size 5 MB to the max. If document size is more than 5 MB then split the document. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o The applicant can anytime go back to previous screen for editing details of the form by clicking Back to Page 1 link. o The applicant can preview the Inclusion in Schedule Form filled by him/her by clicking Preview Inclusion in Schedule Application. Step 7: Click Submit Inclusion in Schedule Application. The submitted Form-C is saved and details for the same can be viewed by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Inclusion in Schedule(cid:2)(cid:2)(cid:2)(cid:2)Submitted Inclusion in Schedule and clicking Download your Inclusion in Schedule Application. Guidelines for Applicant Version 1.0 - Draft 24 11. ENDORSEMENT APPLICATION An applicant can apply for Endorsement by submitting an Endorsement application form available at CIBRC website. To do this the applicant has to login to CIBRC web portal and submit Endorsement application with required details. Following are the steps for submitting Endorsement application: Step 1: Open URL http://pesticides-registrationindia.nic.in/ Step 2: Login using valid credentials. Applicant homepage is displayed. Step 3: On the applicant homepage, navigate to Registration(cid:2)(cid:2)(cid:2)(cid:2) Endorsement. Three links are displayed- Submitted Endorsement, Saved Endorsement and Submit a New Endorsement. Figure 27: Endorsement Options o Submitted Endorsement link displays list of Endorsement applications that have been submitted, with details- Certificate No., Comp. Sr. No., Endorsement Type and Submitted On. Clicking on Download Your Endorsement Application link will generate the preview of the Form submitted. Figure 28: Submitted Endorsement Applications o Saved Endorsement displays the details of the forms that were partly filled by the user but were not submitted. To open a saved form click save and the user can continue to fill the form. Clicking on Click here to Proceed link will display the saved form which the applicant can continue filling. Guidelines for Applicant Version 1.0 - Draft 25 Figure 29: Saved Endorsement Applications o Submit a New Endorsement opens a new Endorsement Application form. Step 4: Click Submit a New Endorsement. Endorsement Application form is displayed. Figure 30: Endorsement Application Form o Fields marked with asterisk (*) are mandatory to be filled: (cid:3) Certificate Number (cid:3) Computer Serial Number o Only Chemistry, Bioefficacy, Packaging and Legal documents are required to be uploaded. Endorsement doesnt involve Toxicity scrutiny. o The Applicant can upload any number of documents, each document of size 5 MB to the max. If document size is more than 5 MB then split the document. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o If there are any products already registered in this new system with your company, you will also be seeing Inclusion In Schedule & Product select options. Step 7: Click Submit. The submitted Endorsement application is saved and details for the same can be viewed by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Inclusion in Schedule(cid:2)(cid:2)(cid:2)(cid:2)Submitted Endorsement and clicking Download your Endorsement Application. Guidelines for Applicant Version 1.0 - Draft 26 12. CHECKING APPLICATION STATUS An applicant can check the status of his application by logging in and selecting the application type under the menu Application Status. Below is the screen that is displayed on clicking Form-I under Application Status menu: Figure 31: Form I Application Status a. This screen shows the details of the submitted Form-Is including the status of the application at the CIBRC end. An application will have one of the following status: o Applied for Registration: The application has just been applied by the applicant and is kept at the reception at the CIBRC. o Under Preliminary Scrutiny: The application has been accepted by the Reception at CIBRC. o Under Clarification: The application is under clarification mode in Preliminary Scrutiny. o Accepted in Preliminary Scrutiny: The application is approved by Preliminary Scrutiny. o Under Technical Scrutiny: The application is undergoing scrutiny by the technical experts. o Technical Scrutiny Complete: The application is done with the technical scrutiny. o Not Accepted: The application is rejected during Preliminary Scrutiny. o Under Technical Agenda: Technical Agenda is being prepared for the application. o RC Approved: The application is approved in RC meeting. o RC Reject: The application is rejected in RC meeting o Certificate Issued: Certificate issued for the application. b. After the registration is issues, the applicants will also be able to download Label & Leaflet corresponding to their applications. c. The Computer Sr. No. for applications under technical scrutiny is a link, clicking on which displays the status of individual folders under scrutiny. d. The Not Accepted status is displayed as a link, opening which displays the status of the checklist regarding that specific application. The points in the checklist complied and not complied by the application are marked by respective tick and cross signs. The comments given by Preliminary Scrutiny officer are also displayed. Guidelines for Applicant Version 1.0 - Draft 27 13. DEFICIENCY REPORT Any deficiency found in the application would be reported to the applicant through an e-mail. Below is a sample e-mail that is sent to the applicant when a deficiency is reported in the application: Figure 32: E-mail for Deficiency Report The applicant can find deficiencies found in their applications by clicking the respective application under the menu Deficiency Reported. To view deficiencies under Form-I application, navigate to Deficiency Reported(cid:2) Form-I. This would display the list of all applications that have been reported deficiencies by the technical experts at CIBRC. Applicant will be reported a deficiency only when all the deficiencies under a folder have been either approved by the secretary or have been closed by technical scrutiny expert. Below is the screen that is displayed on clicking Deficiency Reported: Guidelines for Applicant Version 1.0 - Draft 28 Figure 33: Deficiency Response o Clicking on the folder name of the deficiency displays all the deficiencies reported in that folder. o To respond to the deficiency, applicant must click Response. This displays (cid:1) 2 text fields- Your Response and Document Name. (cid:1) 6 buttons- Add, Clear, Submit Response, Reset, Submit and Clear. o The size of the document to be uploaded must not exceed 5 MB. If size is more than 5 MB then the document must be split. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o Uploading a document while sending a response is not mandatory, but entering a text response in Your Response is. Document name is mandatory if uploading a document. o Hitting the Submit Response button saves the response. o Submit button is initially disabled. It is disabled when response for all the deficiencies for that application have been saved. Clicking Submit sends the response to CIBRC, and the deficiency is removed from the deficiency list. o No deficiency is going to be reported to the user in case of 9(4) category. Such applications will straight way be rejected. o If an applicant doesnt reply a deficiency, a reminder is sent to him to his mailbox. Guidelines for Applicant Version 1.0 - Draft 29 14. SUBMIT GRIEVANCE An applicant can submit grievances regarding the application by logging in and navigating to Grievance(cid:2)(cid:2)(cid:2)(cid:2)Submit Grievance. The link displays a form containing three text fields: Computer Sr. No., File Number and Grievance Description. The screen below is displayed on clicking Submit Grievance. Figure 34: Submit Grievance Screen o Computer Sr. No. and Grievance Description are mandatory fields. o Computer Sr. No. accepts only numeric data. o Computer Sr. No. for an application submitted by any other user would not be accepted. o Clicking Reset button clears all fields. o The user needs to enter the code shown in the picture for security purpose. o Clicking Submit sends the grievance to the Grievance Officer at the CIBRC end. The Applicant receives an e-mail informing about the grievance with a PDF document containing the details of the grievance enclosed with it: Figure 35: E-mail received on submitting Grievance Guidelines for Applicant Version 1.0 - Draft 30 (cid:1) Grievance number format will be CIBGcurrent monthcurrent yrsr. no. (Example: CIBG02090001). Guidelines for Applicant Version 1.0 - Draft 31 15. CHECKING GRIEVANCE STATUS An applicant can check the status of the grievances by logging in and navigating to Grievances(cid:2)(cid:2)(cid:2)(cid:2)Check Grievance Status. This would display a text field namely Grievance Number, which is a mandatory field, a Search button and a Reset button. On clicking Check Grievance Status, the following screen is displayed. Figure 36: Grievance Status Screen o Entering a valid grievance number and clicking Search would display the details of the grievance submitted. o The Grievance Status column for a grievance would show in-progress if the grievance has not yet been replied to the applicant. If the grievance has been replied, the status column would show replied. o If the grievance has been replied to the applicant, Grievance Reply column shows link that will display the grievance reply sent by CIBRC in a new window. Grievance reply date is shown under Reply Date column. Guidelines for Applicant Version 1.0 - Draft 32 16. EDIT PROFILE An applicant can edit personal information by logging in and clicking the Edit Profile link. Edit Profile option allows the user to change the general profile information entered at the time of registration. Steps to edit personal information Step 1: Log in. Step 2: Click Edit Profile link. Step 3: Edit Information. Figure 37: Edit Profile o In the current scenario user can see his profile information but can update only the contact number. Other fields cannot be edited. o If Contact number is a landline number its format should be city code-phone no.. Example: 0130-2241121 If contact number is a mobile number, its format should be (for example) 9810317319 or 09810317319. Only Indian numbers are allowed. Guidelines for Applicant Version 1.0 - Draft 33 Change Password option allows the user to change the current password. On clicking Change Password, the following screen is displayed. Figure 38: Change Password Screen Steps to change the password: Step 1: Log in. Step 2: Click Edit Profile link. Step 3: Click Change Password. This displays 3 text fields- old password, new password and confirm password. All the fields are mandatory. Step 3: Enter Old Password. Step 5: Enter New Password. Step 6: Enter New Password again. Step 7: Click Save. o The password should be min. 8 and max. 14 characters long and have at least 1 alphabet(A-Z or a-z), 1 numeric(0-9) and 1 special character (!,@,#,$,%,,&,+,). o Reset button resets all the fields o The user would not get any e-mail notification regarding change of password. Guidelines for Applicant Version 1.0 - Draft",
  "sections": [
    {
      "title": "Section 1",
      "content": "Computerized Registration of Pesticides Users Guide for On Line Registration Version 1.0 For Applicants Document ID: NIC-AID-PPIN-CROP-USER-MAN-001 Release Date: 23rd September 2009 Project Implementation Central Insecticides Board Agricultural Informatics Division and Registration Committee National Informatics Centre Directorate of Plant Protection, Quarantine Department of Information Technology & Storage Ministry of Communications and Department of Agriculture & Co-operation Information Technology & IT, Government Ministry of Agriculture, Government of India of IndiaA Block CGO Complex NH IV Faridabad (Haryana) - 121001 New Delhi - 110003 Application Software Developed By Infogain India Private Limited A-16 Sector-60 Noida U.P.-201301 http://www.infogain.com Guidelines for Applicant Version 1.0 - Draft 1 Table of Contents 1. Introduction.................................................................................................................3 2. Objective.....................................................................................................................3 3. Scope...........................................................................................................................3 4. Applicant Login..........................................................................................................4 5. New User Registration................................................................................................5 6. Forgot Password..........................................................................................................9 7. Applicant Homepage:...............................................................................................11 8. Form-I Application...................................................................................................12 9. Form-C Application..................................................................................................19 10. Inclusion in Schedule Application............................................................................22 11. Endorsement Application..........................................................................................25 12. Checking Application Status.....................................................................................27 13. Deficiency Report.....................................................................................................28 14. Submit Grievance......................................................................................................30 15. Checking Grievance Status.......................................................................................32 16. Edit Profile................................................................................................................33 Guidelines for Applicant Version 1.0 - Draft 2 1. INTRODUCTION Computerized Registration of Pesticides (CROP) is a web-based application for Registration of Pesticides developed for the Central Insecticides Board and Registration Committee. The application is supposed to automate the entire registration procedure. The highlights of the application are summarized below: o Online Application for Registration of Pesticides under 9(3) & 9(3b) o On line status checking. o Frequent email notification to the applicant at certain milestone of the registration process till Deficiency Reporting & Approval. o Online application for the grievances. 2. OBJECTIVE The objective of this manual is to aid the Applicant (Manufacturers, which happen to be the intended audience of this document) in understanding the features of the CROP application. The user manual provides a step-by-step description of the various functionalities. 3. SCOPE The scope of this document is limited to describe the functionality of the application for applicants. Guidelines for Applicant Version 1.0 - Draft 3 4. APPLICANT LOGIN Any registered user can log into the CIBRC portal by providing the user credentials. The login screen of an applicant is different from that of a CIBRC member. Figure 1: CROP Applicant Login Page o The Login screen displays the following elements: (cid:1) Two text fields, namely username and password. (cid:1) Login button (cid:1) A Security Code (cid:1) A text field to enter the security code (cid:1) Links  Forgot Password New User Register Here User Account Activation Prerequisites for using the system Guidelines for Applicants How to Configure your computer for Hindi Language Download Hindi Fonts Hindi Tutor Download GIST Hindi Typing Tool How to use GIST Hindi Typing Tool Search Product Search Crop Search Insecticide in Schedule o Steps to log into the homepage: 1. Open URL http://www.pesticides-registrationindia.nic.in/ 2. Enter the User Name. 3. Enter the Password. 4. Enter the Security Code as shown in the screen. 5. Click Login to access your homepage. Guidelines for Applicant Version 1.0 - Draft 4 5. NEW USER REGISTRATION Applicants, who have not already registered to CIBRC, need to register themselves before using CIBRC services by clicking New User Register Here link on the login page. The registration form for new users is displayed. Figure 2: New User Registration Step 1 Following is the step by step procedure for applicant sign-up. Step1: New User Registration o The form contains following text fields: First Name, Middle Name, Last Name, E-mail, Password, and Confirm Password. All fields marked with an asterisk (*) are mandatory. o E-mail address is a unique field and must not have been used by any existing user. o Password should be min. 8 and max. 14 characters long and have at least 1 alphabet(A-Z or a-z), 1 numeric(0-9) and 1 special character (!,@,#,$,%,,&,+,). o On clicking Submit, user receives following e-mail containing user credentials and an activation link (click here). User will not get registered unless the account activation link is selected. Guidelines for Applicant Version 1.0 - Draft 5 Figure 3: E-mail for activating new user account Step2: New User Register (Page 2) The activation link takes user to the following page where the user is required to enter the e-mail address and password communicated to him via e-mail, and click Login. Figure 4: New User Registration Page 2 Guidelines for Applicant Version 1.0 - Draft 6 Step3: New User Register (Page 3) Next, the user has to fill a registration form where he has to enter the personal details as well as the company details. Fields marked with an asterisk (*) are mandatory. Figure 5: New User Registration Page 3 Guidelines for Applicant Version 1.0 - Draft 7 o PAN number is unique and must not have been used by any existing user. It must be of 10 characters. o If Contact number is a landline number its format should be city code-phone no.. Example: 0130-2241121 If contact number is a mobile number, its format should be (for example) 9810317319 or 09810317319. Only Indian numbers are allowed. o If the applicants company has already been registered, click Find button to search for the registered company. o An applicant cannot be linked with a company which is already linked with any other applicant. o If the applicants company has not been registered, click click here to register your company. A form is displayed where the user can enter the company details. Fields marked with an asterisk (*) are mandatory. o User must install Hindi fonts and GIST Hindi Typing Tool before filling his/her details. The download links can be found on the applicant login page. o Only Indian companies are allowed to register. So if the companys address other than that of India is provided, the user should not be able to register. o Successful submission of this registration form will activate this new user account. o The user receives following e-mail on completing registration: Figure 6: E-mail received on completing registration Guidelines for Applicant Version 1.0 - Draft 8 6. FORGOT PASSWORD An applicant cannot recover his old password in case he forgets it. However, the applicant can generate new password using the Forgot Password link. The steps to generate password are outlined as below: Step1: Click Forgot Password link on the login page. The password regeneration page is displayed. Figure 7: Password Regeneration Page Step 2: Enter either Login ID or E-mail Id. Step 3: Enter the Security Code as shown in the screen. Step 4: Click Send Password. An E-mail is sent to the applicant Step 5: Click click here link in the e-mail. The Applicant is directed to Change Password Screen. Step 6: Enter New Password and click Save. Guidelines for Applicant Version 1.0 - Draft 9 Figure 8: E-mail received for password recovery Figure 9: Change Password Screen Guidelines for Applicant Version 1.0 - Draft 10 7. APPLICANT HOMEPAGE: On providing correct user credentials, the applicant enters the respective homepage. Figure 10: Applicant Homepage The Homepage displays the following elements: o A welcome message with name of the applicant and last visit date, on the upper-left corner o Three Links at the upper-right corner namely Home, Edit Profile and Logout o Four Menus, namely Registration, Application Status, Deficiency and Grievances o Registration menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Application Status menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Deficiency Reported menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Grievances menu contains following links: Submit Grievance Grievance Status Guidelines for Applicant Version 1.0 - Draft 11 8. FORM-I APPLICATION Form-I is an application for grant of certification of registration of insecticides under following sections:  9(3) TI (Technical Import), FI (Formulation Import), TIM (Technical Indigenous Manufacture), F (Formulation Indigenous Manufacture.), B/F (Bio-Pesticides), Export.  9(3b) TI, FI, TIM, F, B/F.  9(4) TI, FI, TIM, F. The Applicant can access Form-I on his homepage by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Form-I. The link displays three options: -Search submitted Form-I -Saved Form-I -Submit a new Form-I Figure 11: Form-I options o Click Submitted Form-I to list all Form-I Applications submitted by the applicant. To open a submitted form click Download Your Form-I Application. o Click Saved Form-I to display the details of the forms that were partly filled by the user but were not submitted. To open a saved form click Click here to Proceed and the user can continue to fill the form. o Click Submit a new Form-I to open a new Form-I. Guidelines for Applicant Version 1.0 - Draft 12 Form-I Product Details Screen Figure 12: Form-I Product Details Screen o Following fields of the form are mandatory: Product Name in Schedule Section Category Common Name of Insecticide Guidelines for Applicant Version 1.0 - Draft 13 o The items under Product name in schedule are all the items included in the schedule till date. Selecting an item hereby displays its IUPAC name (field no. 6(i)). Applicant will be able to apply only those products, which have been included in schedule. o The Section field contains 3 items namely 9(3), 9(3b) and 9(4). (cid:1) For Section value as 9(4), the available Category values are  TI, FI, TIM and FIM. (cid:1) For Section value as 9(3b), the available Category values are  TI, FI, TIM, FIM and Bio-Pesticides. (cid:1) For Section value as 9(3), the available Category values available are  TI, FI, TIM, FIM, Bio-Pesticides and Export. o The Applicant Details section shows the details of the applicant filled at the time of registration. o The Address of the Premises where manufacture will be done may hold more than one address and also more than one address can be selected. o In the Insecticide details section, the applicant has to provide the Common Name of the Insecticide and the Trade Name of the Insecticide. For 9(4) application, the applicant has to select from the available list already registered Insecticides. o The Product Code drop-down will be enabled only for FI and FIM category. o There can be more than one Previous Computer Serial numbers. In that case the applicant has to separate each number by comma. Previous Computer Serial Numbers are requested to check why the application was rejected previously. o In the Chemical Composition section, for 9(3), 9 (3b) categories the applicant has to provide details for the components from which the Insecticide will be made. (cid:1) More than one chemical can be added by clicking Add Chemical. (cid:1) For 9(4) category, the Chemical Composition details will be displayed depending on the value selected from the Common Name of the Insecticide dropdown. (cid:1) The IUPAC name of the Product is displayed automatically. (cid:1) The Molecular Formula involves subscripts and superscripts. To enter a subscript, the user has to use tags sub and /sub. To enter a superscript, the user has to use tags sup and /sup. For example, to enter the molecular formula CH SO2, the user must type CHsub4/subSOsup2/sup. 4 o The application will check for the number of Form-1 applications the applicant (from a company) has submitted under 9(4) TI /FI /F category for the past 3 months i.e. if the number of Submitted applications for the past 3 months is more than 3 then the applicant will not be allowed to move further (while submitting a New Form-1) for filling Form-1 details. However, the details entered will be saved and the remaining details can be filled later. o Product Conditions  Following are Product Status values for different products: 1. Pesticides Banned for manufacture, import and use 2. Pesticide formulations banned for use but their manufacture is allowed for export 3. Pesticide formulations banned for import, manufacture and use 4. Pesticide Withdrawn 5. Pesticides Refused Registration 6. Pesticides Restricted For Use In India 7. Existing Guidelines for Applicant Version 1.0 - Draft 14 The different product conditions are:  If the Product Status is 1, 4, 5, 6 then the applicant cannot apply  For Product Status 2, the applicant cannot apply under FI / FIM category  For Product Status 3, the applicant cannot apply under FI category o On clicking Save & Continue button, the applicant is taken to Form-1 attachment screen to upload the documents relating to different folders. Form-1 Attachment screen Figure 13: Form-I Attachment Screen o For 9(4) TI/FI/F applications, the folder type will be Others and the applicant has to provide the Other Folder Name. For 9(4) TIM applications, all the folder types will be available in Folder Name drop- down list. For 9(3)/9(3b) FI/F applications, the applicant has to upload MRL document and bioefficacy summary under the bioefficacy folder. Guidelines for Applicant Version 1.0 - Draft 15 For MRL document, the Folder name to be selected will be Bioefficacy, and Document Name should be specified as MRL Proforma For Bioefficacy summary the Folder name to be selected will be Bioefficacy, and Document Name should be specified as Bioefficacy Summary o The size of the document to be uploaded should not exceed 5 MB. If size is more than 5 MB, the document must be split. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o The applicant can any time go back to the previous page by clicking Back to Page 1 o The file that an applicant can attach with a folder must not exceed 5 MB. If the file is greater than 5 MB then the applicant should split the file accordingly. An applicant can attach multiple files for a folder. The supported file types are: PDF, DOC, XLS, GIF, JPEG, JPG, TIF, TXT and DOCX. o Click Save & Continue button to move to the next screen of the Form1. Form I (Page 3): Figure 14: Form-I Registration Page 3 Guidelines for Applicant Version 1.0 - Draft 16 Form-1 Payment screen Figure 15: Form-I Payment Screen o There are two modes of payment- Online and Demand Draft. Only Demand Draft option is available at present. o In case of DD payment following fields are mandatory: Bearing No. (in case of DD payment) Issuing Bank and Branch (in case of DD payment) o After Mode of Payment details have been provided, the applicant will click Submit Form-1 Application button. The applicant will be prompted with a confirmation message box like Are you sure you want to Submit the Form-1 application with two options  OK and Cancel. On clicking OK, the Form-1 will move to reception and its status will be changed to Applied for Registration and a copy of Form-1 will be sent on the e-mail of the applicant. o If the user doesnt submit the form or closes the screen before submitting, the form is automatically saved and user can rework on it by opening saved Form-I by going to Registration(cid:2)Form-1(cid:2)Search Saved Form-1. o An applicant can preview the Form-I by using the Preview Form-1 Application link. o On successful submission of Form-I, the applicant receives an acknowledgement e- mail containing the Computer Sr. No. of the application: Guidelines for Applicant Version 1.0 - Draft 17 Figure 16: E-mail received on submitting Form-I o The applicant can any time go back to any of the previous pages by clicking Back to Page 3, Back to Page 2, or Back to Page 1. o While the application is in progress same Applicant Company should not be able to apply for the same product under same category of registration. Once the application gets rejected then same applicant company can reapply for the same product with submission of required data. o Applicant will be able to apply for the registration certificate for only those products, which have been included in the schedule. o Along with the online submission of Form-I, applicant needs to submit the hard copy of the documents and product sample at CIBRC Reception. It is only when both hard and soft copies of the application have been received at the reception that the application is passed onto Preliminary Scrutiny. o The applicant is required to re-pay the registration fee in case of re-apply. o In case of reapply, the applicant must provide the Computer serial number of the previous/rejected application. If application is rejected multiple times then the applicant has to provide all the previous computer serial numbers while reapplying. Guidelines for Applicant Version 1.0 - Draft 18 9. FORM-C APPLICATION An applicant can apply for Research, Test and Trial (RTT) by submitting Form-C. To do this the applicant has to login to CIBRC web portal and submit Form C with required details. Following are the steps for submitting Form-C: Step 1: Open URL http://pesticides-registrationindia.nic.in/ Step 2: Login using valid credentials. Applicant homepage is displayed. Step 3: On the applicant homepage, navigate to Registration(cid:2)(cid:2)(cid:2)(cid:2) Form C. Three links are displayed- Submitted Form-C, Saved Form-C and Submit a New Form-C Figure 17: Form-C Options o Submitted Form-C link will display the list of Form Cs submitted by the applicant. The details of the form shown are- Name of the Manufacturer, Name of Supplier, Chemical Name, Active Product Group, Submission status, Submitted On. Clicking on Download Your Form-C Application link will generate the details of the application submitted. Figure 18: Submitted Form-C o Saved Form-C link will display the list of forms which were the applicant didnt submit but saved in the middle of filling up the form. The details of the form shown are- Name of the Manufacturer, Name of Supplier, Chemical Name, Active Product Group, Submission status, Submitted On. Clicking on Click here to Proceed link will display the saved form which the applicant can continue filling. Guidelines for Applicant Version 1.0 - Draft 19 Figure 19: Saved Form-C o Submit a New Form-C link will open a new Form-C. Step 4: Click Submit a New Form-C. Form-C is displayed. Figure 20: Form C Application Form Page 1 Guidelines for Applicant Version 1.0 - Draft 20 o The mandatory fields to be filled by the applicant are: (cid:3) Name of overseas manufacturer (cid:3) Name of Supplier (cid:3) Code Number (cid:3) Chemical Name (cid:3) Whether manufacture, sale, distribution or use is prohibited in the country of its manufacture or any restrictions have been imported thereon. If so, please give full details (cid:3) Main active group to which the chemical belongs (cid:3) Whether being imported as free sample and if so its nominal value (cid:3) Whether any examination, analysis, tests or trials are already being carried on in the country and if so, please give details o The applicant can enter more than one Previous Computer Serial Numbers each separated by a comma. o Preview Form-C Application link can be used to see the details entered by the applicant in the Form-C Step 5: Click Save & Continue. This will save the form and will take user to the Page 2 (Attachment Screen) of Form-C. Figure 21: Form C Application Page 2 Step 6: Upload Documents. o Only Bioefficacy and Toxicity documents are required to be uploaded. o The Applicant can upload any number of documents, each document of size 5 MB to the max. If document size is more than 5 MB then split the document. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o The applicant can anytime go back to previous screen for editing details of the form by clicking Back to Page 1 link. o The applicant can preview the Inclusion in Schedule Form filled by him/her by clicking Preview Form-C Application. Step 7: Click Submit Form-C Application. The submitted Form-C is saved and details for the same can be viewed by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Form-C(cid:2)(cid:2)(cid:2)(cid:2)Submitted Form-C and clicking Download your Form-C Application. Guidelines for Applicant Version 1.0 - Draft 21 10. INCLUSION IN SCHEDULE APPLICATION An applicant can apply for Inclusion in Schedule by submitting Inclusion in Schedule form available at CIBRC website. To do this the applicant has to login to CIBRC web portal and submit Inclusion in Schedule form with required details. Following are the steps for submitting Inclusion in Schedule form: Step 1: Open URL http://pesticides-registrationindia.nic.in/ Step 2: Login using valid credentials. Applicant homepage is displayed. Step 3: On the applicant homepage, navigate to Registration(cid:2)(cid:2)(cid:2)(cid:2) Inclusion in Schedule. Three links are displayed- Submitted Inclusion in Schedule, Saved Inclusion in Schedule and Submit a New Inclusion in Schedule. Figure 22: Inclusion in Schedule Options o Submitted Inclusion in Schedule link displays the list of Inclusion in Schedule Forms submitted by the applicant. The details of the form shown are- Name of the Applicant, Common Name, IUPAC/Botanical Name, Submission status, Submitted On. Clicking on Download Your Inclusion in Schedule Application link will generate the preview of the Form submitted. Figure 23: Submitted Inclusion in Schedule Applications o Saved Inclusion in Schedule displays the list of forms which were the applicant didnt submit but saved in the middle of filling up the form. The details of the form shown are- Name of the Applicant, Common Name, IUPAC/Botanical Name, Submission status, Saved On. Clicking on Click here to Proceed link will display the saved form which the applicant can continue filling. Guidelines for Applicant Version 1.0 - Draft 22 Figure 24: Saved Inclusion in Schedule Applications o Submit New Inclusion in Schedule opens a new Inclusion in Schedule Form. Step 4: Click Submit a New Inclusion in Schedule. Inclusion in Schedule application form is displayed. Figure 25: Inclusion in Schedule Application Form Page 1 o Fields marked with asterisk (*) are mandatory to be filled: (cid:3) Common Name (cid:3) IUPAC/Botanical Name (cid:3) CAS No. o The applicant can enter more than one Previous Computer Serial Numbers each separated by a comma. Step 5: Click Save & Continue. This will save the form and will take user to the Page 2 (Attachment Screen) for Inclusion in Schedule. Guidelines for Applicant Version 1.0 - Draft 23 Figure 26: Inclusion in Schedule Application Form Page 2 Step 6: Upload Documents. o Only Chemistry, Bioefficacy and Toxicity documents are required to be uploaded. o The Applicant can upload any number of documents, each document of size 5 MB to the max. If document size is more than 5 MB then split the document. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o The applicant can anytime go back to previous screen for editing details of the form by clicking Back to Page 1 link. o The applicant can preview the Inclusion in Schedule Form filled by him/her by clicking Preview Inclusion in Schedule Application. Step 7: Click Submit Inclusion in Schedule Application. The submitted Form-C is saved and details for the same can be viewed by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Inclusion in Schedule(cid:2)(cid:2)(cid:2)(cid:2)Submitted Inclusion in Schedule and clicking Download your Inclusion in Schedule Application. Guidelines for Applicant Version 1.0 - Draft 24 11. ENDORSEMENT APPLICATION An applicant can apply for Endorsement by submitting an Endorsement application form available at CIBRC website. To do this the applicant has to login to CIBRC web portal and submit Endorsement application with required details. Following are the steps for submitting Endorsement application: Step 1: Open URL http://pesticides-registrationindia.nic.in/ Step 2: Login using valid credentials. Applicant homepage is displayed. Step 3: On the applicant homepage, navigate to Registration(cid:2)(cid:2)(cid:2)(cid:2) Endorsement. Three links are displayed- Submitted Endorsement, Saved Endorsement and Submit a New Endorsement. Figure 27: Endorsement Options o Submitted Endorsement link displays list of Endorsement applications that have been submitted, with details- Certificate No., Comp. Sr. No., Endorsement Type and Submitted On. Clicking on Download Your Endorsement Application link will generate the preview of the Form submitted. Figure 28: Submitted Endorsement Applications o Saved Endorsement displays the details of the forms that were partly filled by the user but were not submitted. To open a saved form click save and the user can continue to fill the form. Clicking on Click here to Proceed link will display the saved form which the applicant can continue filling. Guidelines for Applicant Version 1.0 - Draft 25 Figure 29: Saved Endorsement Applications o Submit a New Endorsement opens a new Endorsement Application form. Step 4: Click Submit a New Endorsement. Endorsement Application form is displayed. Figure 30: Endorsement Application Form o Fields marked with asterisk (*) are mandatory to be filled: (cid:3) Certificate Number (cid:3) Computer Serial Number o Only Chemistry, Bioefficacy, Packaging and Legal documents are required to be uploaded. Endorsement doesnt involve Toxicity scrutiny. o The Applicant can upload any number of documents, each document of size 5 MB to the max. If document size is more than 5 MB then split the document. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o If there are any products already registered in this new system with your company, you will also be seeing Inclusion In Schedule & Product select options. Step 7: Click Submit. The submitted Endorsement application is saved and details for the same can be viewed by navigating to Registration(cid:2)(cid:2)(cid:2)(cid:2)Inclusion in Schedule(cid:2)(cid:2)(cid:2)(cid:2)Submitted Endorsement and clicking Download your Endorsement Application. Guidelines for Applicant Version 1.0 - Draft 26 12. CHECKING APPLICATION STATUS An applicant can check the status of his application by logging in and selecting the application type under the menu Application Status. Below is the screen that is displayed on clicking Form-I under Application Status menu: Figure 31: Form I Application Status a. This screen shows the details of the submitted Form-Is including the status of the application at the CIBRC end. An application will have one of the following status: o Applied for Registration: The application has just been applied by the applicant and is kept at the reception at the CIBRC. o Under Preliminary Scrutiny: The application has been accepted by the Reception at CIBRC. o Under Clarification: The application is under clarification mode in Preliminary Scrutiny. o Accepted in Preliminary Scrutiny: The application is approved by Preliminary Scrutiny. o Under Technical Scrutiny: The application is undergoing scrutiny by the technical experts. o Technical Scrutiny Complete: The application is done with the technical scrutiny. o Not Accepted: The application is rejected during Preliminary Scrutiny. o Under Technical Agenda: Technical Agenda is being prepared for the application. o RC Approved: The application is approved in RC meeting. o RC Reject: The application is rejected in RC meeting o Certificate Issued: Certificate issued for the application. b. After the registration is issues, the applicants will also be able to download Label & Leaflet corresponding to their applications. c. The Computer Sr. No. for applications under technical scrutiny is a link, clicking on which displays the status of individual folders under scrutiny. d. The Not Accepted status is displayed as a link, opening which displays the status of the checklist regarding that specific application. The points in the checklist complied and not complied by the application are marked by respective tick and cross signs. The comments given by Preliminary Scrutiny officer are also displayed. Guidelines for Applicant Version 1.0 - Draft 27 13. DEFICIENCY REPORT Any deficiency found in the application would be reported to the applicant through an e-mail. Below is a sample e-mail that is sent to the applicant when a deficiency is reported in the application: Figure 32: E-mail for Deficiency Report The applicant can find deficiencies found in their applications by clicking the respective application under the menu Deficiency Reported. To view deficiencies under Form-I application, navigate to Deficiency Reported(cid:2) Form-I. This would display the list of all applications that have been reported deficiencies by the technical experts at CIBRC. Applicant will be reported a deficiency only when all the deficiencies under a folder have been either approved by the secretary or have been closed by technical scrutiny expert. Below is the screen that is displayed on clicking Deficiency Reported: Guidelines for Applicant Version 1.0 - Draft 28 Figure 33: Deficiency Response o Clicking on the folder name of the deficiency displays all the deficiencies reported in that folder. o To respond to the deficiency, applicant must click Response. This displays (cid:1) 2 text fields- Your Response and Document Name. (cid:1) 6 buttons- Add, Clear, Submit Response, Reset, Submit and Clear. o The size of the document to be uploaded must not exceed 5 MB. If size is more than 5 MB then the document must be split. The supported document types are: pdf, doc, xls, gif, jpeg, jpg, tif, txt and docx. o Uploading a document while sending a response is not mandatory, but entering a text response in Your Response is. Document name is mandatory if uploading a document. o Hitting the Submit Response button saves the response. o Submit button is initially disabled. It is disabled when response for all the deficiencies for that application have been saved. Clicking Submit sends the response to CIBRC, and the deficiency is removed from the deficiency list. o No deficiency is going to be reported to the user in case of 9(4) category. Such applications will straight way be rejected. o If an applicant doesnt reply a deficiency, a reminder is sent to him to his mailbox. Guidelines for Applicant Version 1.0 - Draft 29 14. SUBMIT GRIEVANCE An applicant can submit grievances regarding the application by logging in and navigating to Grievance(cid:2)(cid:2)(cid:2)(cid:2)Submit Grievance. The link displays a form containing three text fields: Computer Sr. No., File Number and Grievance Description. The screen below is displayed on clicking Submit Grievance. Figure 34: Submit Grievance Screen o Computer Sr. No. and Grievance Description are mandatory fields. o Computer Sr. No. accepts only numeric data. o Computer Sr. No. for an application submitted by any other user would not be accepted. o Clicking Reset button clears all fields. o The user needs to enter the code shown in the picture for security purpose. o Clicking Submit sends the grievance to the Grievance Officer at the CIBRC end. The Applicant receives an e-mail informing about the grievance with a PDF document containing the details of the grievance enclosed with it: Figure 35: E-mail received on submitting Grievance Guidelines for Applicant Version 1.0 - Draft 30 (cid:1) Grievance number format will be CIBGcurrent monthcurrent yrsr. no. (Example: CIBG02090001). Guidelines for Applicant Version 1.0 - Draft 31 15. CHECKING GRIEVANCE STATUS An applicant can check the status of the grievances by logging in and navigating to Grievances(cid:2)(cid:2)(cid:2)(cid:2)Check Grievance Status. This would display a text field namely Grievance Number, which is a mandatory field, a Search button and a Reset button. On clicking Check Grievance Status, the following screen is displayed. Figure 36: Grievance Status Screen o Entering a valid grievance number and clicking Search would display the details of the grievance submitted. o The Grievance Status column for a grievance would show in-progress if the grievance has not yet been replied to the applicant. If the grievance has been replied, the status column would show replied. o If the grievance has been replied to the applicant, Grievance Reply column shows link that will display the grievance reply sent by CIBRC in a new window. Grievance reply date is shown under Reply Date column. Guidelines for Applicant Version 1.0 - Draft 32 16. EDIT PROFILE An applicant can edit personal information by logging in and clicking the Edit Profile link. Edit Profile option allows the user to change the general profile information entered at the time of registration. Steps to edit personal information Step 1: Log in. Step 2: Click Edit Profile link. Step 3: Edit Information. Figure 37: Edit Profile o In the current scenario user can see his profile information but can update only the contact number. Other fields cannot be edited. o If Contact number is a landline number its format should be city code-phone no.. Example: 0130-2241121 If contact number is a mobile number, its format should be (for example) 9810317319 or 09810317319. Only Indian numbers are allowed. Guidelines for Applicant Version 1.0 - Draft 33 Change Password option allows the user to change the current password. On clicking Change Password, the following screen is displayed. Figure 38: Change Password Screen Steps to change the password: Step 1: Log in. Step 2: Click Edit Profile link. Step 3: Click Change Password. This displays 3 text fields- old password, new password and confirm password. All the fields are mandatory. Step 3: Enter Old Password. Step 5: Enter New Password. Step 6: Enter New Password again. Step 7: Click Save. o The password should be min. 8 and max. 14 characters long and have at least 1 alphabet(A-Z or a-z), 1 numeric(0-9) and 1 special character (!,@,#,$,%,,&,+,). o Reset button resets all the fields o The user would not get any e-mail notification regarding change of password. Guidelines for Applicant Version 1.0 - Draft",
      "page_number": 1,
      "section_type": "content",
      "keywords": [
        "user",
        "click",
        "form",
        "approval",
        "version",
        "document",
        "application",
        "registration",
        "guideline",
        "support",
        "inclusion",
        "draft",
        "guidelines",
        "schedule",
        "submitted",
        "applicant",
        "review",
        "payment",
        "step",
        "detail",
        "grievance",
        "link",
        "submit",
        "implementation",
        "figure",
        "name"
      ]
    }
  ],
  "metadata": {
    "source_file": "pdfs\\Pesticides_Registration.pdf",
    "file_size": 1308297,
    "extraction_date": "2025-08-13T13:57:51.044385",
    "department": "Ministry of Communications"
  },
  "keywords": [
    "user",
    "click",
    "form",
    "approval",
    "version",
    "document",
    "application",
    "registration",
    "guideline",
    "support",
    "inclusion",
    "draft",
    "guidelines",
    "schedule",
    "submitted",
    "applicant",
    "review",
    "payment",
    "step",
    "detail",
    "grievance",
    "link",
    "submit",
    "implementation",
    "figure",
    "name"
  ],
  "summary": "Computerized Registration of Pesticides Users Guide for On Line Registration Version 1.0 For Applicants Document ID: NIC-AID-PPIN-CROP-USER-MAN-001 Release Date: 23rd September 2009 Project Implementation Central Insecticides Board Agricultural Informatics Division and Registration Committee National Informatics Centre Directorate of Plant Protection, Quarantine Department of Information Technology & Storage Ministry of Communications and Department of Agriculture & Co-operation Information Technology & IT, Government Ministry of Agriculture, Government of India of IndiaA Block CGO Complex NH IV Faridabad (Haryana) - 121001 New Delhi - 110003 Application Software Developed By Infogain India Private Limited A-16 Sector-60 Noida U.P.-201301 http://www.infogain.com Guidelines for Applicant Version 1.0 - Draft 1 Table of Contents 1. Figure 10: Applicant Homepage The Homepage displays the following elements: o A welcome message with name of the applicant and last visit date, on the upper-left corner o Three Links at the upper-right corner namely Home, Edit Profile and Logout o Four Menus, namely Registration, Application Status, Deficiency and Grievances o Registration menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Application Status menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Deficiency Reported menu contains following links: Form-I Form-C Inclusion in Schedule Endorsement o Grievances menu contains following links: Submit Grievance Grievance Status Guidelines for Applicant Version 1.0 - Draft 11 8. Form I (Page 3): Figure 14: Form-I Registration Page 3 Guidelines for Applicant Version 1.0 - Draft 16 Form-1 Payment screen Figure 15: Form-I Payment Screen o There are two modes of payment- Online and Demand Draft.",
  "source_file": "pdfs\\Pesticides_Registration.pdf",
  "processed_date": "2025-08-13T13:57:51.087930",
  "document_hash": "eec2b4a7c6306d8341415fc7b81945f2"
}